<abi-corpus-group architecture='elf-arm-aarch64'>
  <abi-corpus path='vmlinux' architecture='elf-arm-aarch64'>
    <elf-function-symbols>
      <elf-symbol name='___ratelimit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x1d24c881'/>
      <elf-symbol name='__alloc_percpu' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x949f7342'/>
      <elf-symbol name='__arch_copy_from_user' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xaf507de1'/>
      <elf-symbol name='__arch_copy_to_user' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x6b2941b2'/>
      <elf-symbol name='__arm_smccc_smc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xf93aae46'/>
      <elf-symbol name='__check_object_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x88db9f48'/>
      <elf-symbol name='__class_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x1da6db5d'/>
      <elf-symbol name='__clk_get_hw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xce3936ef'/>

      <elf-symbol name='cpu_hwcap_keys' size='228' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x2550db38'/>
      <elf-symbol name='cpu_hwcaps' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4f1c18e7'/>
      <elf-symbol name='cpu_number' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x7a2af7b4'/>
      <elf-symbol name='cpu_subsys' size='176' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x33e28770'/>
      <elf-symbol name='i2c_adapter_type' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xd2074a0e'/>
      <elf-symbol name='i2c_bus_type' size='176' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xa759ac8'/>
      <elf-symbol name='iomem_resource' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x77358855'/>
      <elf-symbol name='kernel_kobj' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xf8359151'/>
      <elf-symbol name='kimage_voffset' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xe4bbc1dd'/>
      <elf-symbol name='kmalloc_caches' size='336' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xa2985936'/>
      <elf-symbol name='nr_cpu_ids' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x17de3d5'/>
      <elf-symbol name='of_fwnode_ops' size='144' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x256b162d'/>
      <elf-symbol name='of_root' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x79b9d6f3'/>
      <elf-symbol name='panic_notifier_list' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x7ceeac9'/>
      <elf-symbol name='param_ops_int' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xa55a1f35'/>
      <elf-symbol name='param_ops_uint' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x48dbadb5'/>
      <elf-symbol name='param_ops_ullong' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xb6cfb0a3'/>
      <elf-symbol name='pci_bus_type' size='176' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x88e05d97'/>
      <elf-symbol name='physvirt_offset' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x1ba7c500'/>
      <elf-symbol name='system_freezable_wq' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xd4034828'/>
      <elf-symbol name='system_state' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x15af7f4'/>
      <elf-symbol name='system_unbound_wq' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xd4c14632'/>
      <elf-symbol name='system_wq' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x2d3385d3'/>
      <elf-symbol name='usb_debug_root' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xb1378b05'/>
      <elf-symbol name='usb_hcd_pci_pm_ops' size='184' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xcb2cd8e4'/>
      <elf-symbol name='vabits_actual' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xc56a41e6'/>
      <elf-symbol name='vmemmap' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x46d32467'/>
    </elf-variable-symbols>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/cacheinfo.c' language='LANG_C89'>
      <function-decl name='smp_call_function_single' mangled-name='smp_call_function_single' filepath='include/linux/smp.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='smp_call_function_single'>
        <parameter type-id='95e97e5e'/>
        <parameter type-id='b7f9d8e6'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='95e97e5e'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/cpu_ops.c' language='LANG_C89'>
      <qualified-type-def type-id='6661a698' const='yes' id='5558489b'/>
      <pointer-type-def type-id='5558489b' size-in-bits='64' id='0afa6ea3'/>
      <function-decl name='of_get_property' mangled-name='of_get_property' filepath='include/linux/of.h' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='of_get_property'>
        <parameter type-id='0afa6ea3'/>
        <parameter type-id='80f4b756'/>
        <parameter type-id='7292109c'/>
        <return type-id='eaa32e2f'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/cpufeature.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='237c0d27' size-in-bits='1824' id='f4bcbdfb'>
        <subrange length='57' type-id='7ff19f0f' id='3c11a509'/>
      </array-type-def>
      <class-decl name='static_key_false' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/linux/jump_label.h' line='350' column='1' id='237c0d27'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='key' type-id='00205383' visibility='default' filepath='include/linux/jump_label.h' line='351' column='1'/>
        </data-member>
      </class-decl>
      <var-decl name='arm64_use_ng_mappings' type-id='b50a4934' mangled-name='arm64_use_ng_mappings' visibility='default' filepath='arch/arm64/kernel/cpufeature.c' line='103' column='1' elf-symbol-id='arm64_use_ng_mappings'/>
      <var-decl name='arm64_const_caps_ready' type-id='237c0d27' mangled-name='arm64_const_caps_ready' visibility='default' filepath='arch/arm64/kernel/cpufeature.c' line='115' column='1' elf-symbol-id='arm64_const_caps_ready'/>
      <var-decl name='cpu_hwcap_keys' type-id='f4bcbdfb' mangled-name='cpu_hwcap_keys' visibility='default' filepath='arch/arm64/kernel/cpufeature.c' line='128' column='1' elf-symbol-id='cpu_hwcap_keys'/>
      <var-decl name='cpu_hwcaps' type-id='f066dd3c' mangled-name='cpu_hwcaps' visibility='default' filepath='arch/arm64/kernel/cpufeature.c' line='96' column='1' elf-symbol-id='cpu_hwcaps'/>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/cpuinfo.c' language='LANG_C89'>
      <class-decl name='module' is-struct='yes' visibility='default' is-declaration-only='yes' id='29476915'/>
      <union-decl name='__anonymous_union__4' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='77' column='1' id='f3cbec73'>
        <member-type access='private'>
          <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='144' column='1' id='931c6b21'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_pt_pad_1' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='145' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='pmd_huge_pte' type-id='c28b9700' visibility='default' filepath='include/linux/mm_types.h' line='146' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_pt_pad_2' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='147' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='' type-id='f2cbeae0' visibility='default' filepath='include/linux/mm_types.h' line='148' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='256'>
              <var-decl name='ptl' type-id='fb4018a0' visibility='default' filepath='include/linux/mm_types.h' line='155' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='158' column='1' id='a5bc8a30'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='pgmap' type-id='b1a5e68a' visibility='default' filepath='include/linux/mm_types.h' line='160' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='zone_device_data' type-id='eaa32e2f' visibility='default' filepath='include/linux/mm_types.h' line='161' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private'>
          <var-decl name='' type-id='c1d98853' visibility='default' filepath='include/linux/mm_types.h' line='78' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='callback_head' type-id='e3d8ce29' visibility='default' filepath='include/linux/mm_types.h' line='175' column='1'/>
        </data-member>
      </union-decl>
      <union-decl name='__anonymous_union__5' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='148' column='1' id='f2cbeae0'>
        <data-member access='private'>
          <var-decl name='pt_mm' type-id='df4b7819' visibility='default' filepath='include/linux/mm_types.h' line='149' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='pt_frag_refcount' type-id='49178f86' visibility='default' filepath='include/linux/mm_types.h' line='150' column='1'/>
        </data-member>
      </union-decl>
      <pointer-type-def type-id='29476915' size-in-bits='64' id='2730d015'/>
      <function-decl name='seq_puts' mangled-name='seq_puts' filepath='include/linux/seq_file.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='seq_puts'>
        <parameter type-id='f8dc9def'/>
        <parameter type-id='80f4b756'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='kobject_init' mangled-name='kobject_init' filepath='include/linux/kobject.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='kobject_init'>
        <parameter type-id='d30bdc51'/>
        <parameter type-id='c48b394e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='kobject_add' mangled-name='kobject_add' filepath='include/linux/kobject.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='kobject_add'>
        <parameter type-id='d30bdc51'/>
        <parameter type-id='d30bdc51'/>
        <parameter type-id='80f4b756'/>
        <parameter is-variadic='yes'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='sysfs_create_group' mangled-name='sysfs_create_group' filepath='include/linux/sysfs.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sysfs_create_group'>
        <parameter type-id='d30bdc51'/>
        <parameter type-id='8ff9530e'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='sysfs_remove_group' mangled-name='sysfs_remove_group' filepath='include/linux/sysfs.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sysfs_remove_group'>
        <parameter type-id='d30bdc51'/>
        <parameter type-id='8ff9530e'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/fpsimd.c' language='LANG_C89'>
      <class-decl name='notifier_block' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/notifier.h' line='54' column='1' id='9b08f7cd'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='notifier_call' type-id='0ec8c658' visibility='default' filepath='include/linux/notifier.h' line='55' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='next' type-id='d504f73d' visibility='default' filepath='include/linux/notifier.h' line='56' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='priority' type-id='95e97e5e' visibility='default' filepath='include/linux/notifier.h' line='57' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='notifier_fn_t' type-id='38a7cb79' filepath='include/linux/notifier.h' line='51' column='1' id='0ec8c658'/>
      <pointer-type-def type-id='9cbd1c16' size-in-bits='64' id='f9b37274'/>
      <pointer-type-def type-id='294be38d' size-in-bits='64' id='38a7cb79'/>
      <pointer-type-def type-id='9b08f7cd' size-in-bits='64' id='d504f73d'/>
      <function-decl name='find_next_bit' mangled-name='find_next_bit' filepath='include/asm-generic/bitops/find.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='find_next_bit'>
        <parameter type-id='f9b37274'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='7359adad'/>
        <return type-id='7359adad'/>
      </function-decl>
      <function-decl name='preempt_schedule' mangled-name='preempt_schedule' filepath='arch/arm64/include/asm/preempt.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='preempt_schedule'>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='cpu_pm_register_notifier' mangled-name='cpu_pm_register_notifier' filepath='include/linux/cpu_pm.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cpu_pm_register_notifier'>
        <parameter type-id='d504f73d'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-type size-in-bits='64' id='294be38d'>
        <parameter type-id='d504f73d'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='eaa32e2f'/>
        <return type-id='95e97e5e'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/irq.c' language='LANG_C89'>
      <class-decl name='trace_event_call' is-struct='yes' visibility='default' is-declaration-only='yes' id='fd48a6e6'/>
      <class-decl name='user_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='8c178e22'/>
      <class-decl name='wait_page_queue' is-struct='yes' visibility='default' is-declaration-only='yes' id='7bb07bfa'/>
      <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/uio.h' line='39' column='1' id='f9cbf5e5'>
        <data-member access='private'>
          <var-decl name='iov' type-id='2c556848' visibility='default' filepath='include/linux/uio.h' line='40' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='kvec' type-id='5199c30d' visibility='default' filepath='include/linux/uio.h' line='41' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='bvec' type-id='15c9a01b' visibility='default' filepath='include/linux/uio.h' line='42' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='pipe' type-id='15d29710' visibility='default' filepath='include/linux/uio.h' line='43' column='1'/>
        </data-member>
      </union-decl>
      <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/uio.h' line='45' column='1' id='f8cbf452'>
        <data-member access='private'>
          <var-decl name='nr_segs' type-id='7359adad' visibility='default' filepath='include/linux/uio.h' line='46' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='' type-id='c0d986c0' visibility='default' filepath='include/linux/uio.h' line='47' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='__anonymous_struct__' size-in-bits='7040' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='392' column='1' id='e7f43f72'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='mmap' type-id='2ae08426' visibility='default' filepath='include/linux/mm_types.h' line='393' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='mm_rb' type-id='dec44472' visibility='default' filepath='include/linux/mm_types.h' line='394' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='vmacache_seqnum' type-id='91ce1af9' visibility='default' filepath='include/linux/mm_types.h' line='395' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='get_unmapped_area' type-id='d44a8cec' visibility='default' filepath='include/linux/mm_types.h' line='397' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='mmap_base' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='401' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='mmap_legacy_base' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='402' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='task_size' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='408' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='highest_vm_end' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='409' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='pgd' type-id='2e97ceaf' visibility='default' filepath='include/linux/mm_types.h' line='410' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='membarrier_state' type-id='49178f86' visibility='default' filepath='include/linux/mm_types.h' line='419' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='608'>
          <var-decl name='mm_users' type-id='49178f86' visibility='default' filepath='include/linux/mm_types.h' line='431' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='mm_count' type-id='49178f86' visibility='default' filepath='include/linux/mm_types.h' line='440' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='pgtables_bytes' type-id='f22a8abb' visibility='default' filepath='include/linux/mm_types.h' line='443' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='map_count' type-id='95e97e5e' visibility='default' filepath='include/linux/mm_types.h' line='445' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='800'>
          <var-decl name='page_table_lock' type-id='fb4018a0' visibility='default' filepath='include/linux/mm_types.h' line='447' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='mmap_lock' type-id='f19fdb93' visibility='default' filepath='include/linux/mm_types.h' line='450' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='mmlist' type-id='72f469ec' visibility='default' filepath='include/linux/mm_types.h' line='452' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='hiwater_rss' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='459' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='hiwater_vm' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='460' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='total_vm' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='462' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='locked_vm' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='463' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='pinned_vm' type-id='28ee064c' visibility='default' filepath='include/linux/mm_types.h' line='464' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='data_vm' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='465' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='exec_vm' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='466' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='stack_vm' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='467' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='def_flags' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='468' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='arg_lock' type-id='fb4018a0' visibility='default' filepath='include/linux/mm_types.h' line='470' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='start_code' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='471' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='end_code' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='471' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='start_data' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='471' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='end_data' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='471' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='start_brk' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='472' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='brk' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='472' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='start_stack' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='472' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='arg_start' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='473' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='arg_end' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='473' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='env_start' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='473' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='env_end' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='473' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='saved_auxv' type-id='d964a553' visibility='default' filepath='include/linux/mm_types.h' line='475' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5632'>
          <var-decl name='rss_stat' type-id='2235a2cb' visibility='default' filepath='include/linux/mm_types.h' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5888'>
          <var-decl name='binfmt' type-id='7cc59444' visibility='default' filepath='include/linux/mm_types.h' line='483' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5952'>
          <var-decl name='context' type-id='0eb9c3fd' visibility='default' filepath='include/linux/mm_types.h' line='486' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6208'>
          <var-decl name='flags' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='488' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6272'>
          <var-decl name='core_state' type-id='90ad83aa' visibility='default' filepath='include/linux/mm_types.h' line='490' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6336'>
          <var-decl name='ioctx_lock' type-id='fb4018a0' visibility='default' filepath='include/linux/mm_types.h' line='493' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6400'>
          <var-decl name='ioctx_table' type-id='122191b2' visibility='default' filepath='include/linux/mm_types.h' line='494' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6464'>
          <var-decl name='owner' type-id='f23e2572' visibility='default' filepath='include/linux/mm_types.h' line='507' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6528'>
          <var-decl name='user_ns' type-id='c0ced320' visibility='default' filepath='include/linux/mm_types.h' line='509' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6592'>
          <var-decl name='exe_file' type-id='77e79a4b' visibility='default' filepath='include/linux/mm_types.h' line='512' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6656'>
          <var-decl name='tlb_flush_pending' type-id='49178f86' visibility='default' filepath='include/linux/mm_types.h' line='538' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6720'>
          <var-decl name='uprobes_state' type-id='6308a819' visibility='default' filepath='include/linux/mm_types.h' line='543' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6784'>
          <var-decl name='async_put_work' type-id='ef9025d0' visibility='default' filepath='include/linux/mm_types.h' line='547' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__6' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='77' column='1' id='f5cbef99'>
        <member-type access='private'>
          <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='144' column='1' id='433df9b7'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_pt_pad_1' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='145' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='pmd_huge_pte' type-id='c28b9700' visibility='default' filepath='include/linux/mm_types.h' line='146' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_pt_pad_2' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='147' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='' type-id='f4cbee06' visibility='default' filepath='include/linux/mm_types.h' line='148' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='256'>
              <var-decl name='ptl' type-id='fb4018a0' visibility='default' filepath='include/linux/mm_types.h' line='155' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private'>
          <var-decl name='' type-id='c1d98853' visibility='default' filepath='include/linux/mm_types.h' line='78' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='callback_head' type-id='e3d8ce29' visibility='default' filepath='include/linux/mm_types.h' line='175' column='1'/>
        </data-member>
      </union-decl>
      <union-decl name='__anonymous_union__7' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/mm_types.h' line='148' column='1' id='f4cbee06'>
        <data-member access='private'>
          <var-decl name='pt_mm' type-id='df4b7819' visibility='default' filepath='include/linux/mm_types.h' line='149' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='pt_frag_refcount' type-id='49178f86' visibility='default' filepath='include/linux/mm_types.h' line='150' column='1'/>
        </data-member>
      </union-decl>
      <qualified-type-def type-id='1354385d' const='yes' id='6b2a4486'/>
      <pointer-type-def type-id='6b2a4486' size-in-bits='64' id='5f8a1ac4'/>
      <pointer-type-def type-id='fd48a6e6' size-in-bits='64' id='23d6768c'/>
      <pointer-type-def type-id='23d6768c' size-in-bits='64' id='109cc752'/>
      <pointer-type-def type-id='8c178e22' size-in-bits='64' id='c0ced320'/>
      <pointer-type-def type-id='7bb07bfa' size-in-bits='64' id='4be56288'/>
      <function-decl name='seq_printf' mangled-name='seq_printf' filepath='include/linux/seq_file.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='seq_printf'>
        <parameter type-id='f8dc9def'/>
        <parameter type-id='80f4b756'/>
        <parameter is-variadic='yes'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='cpumask_next' mangled-name='cpumask_next' filepath='include/linux/cpumask.h' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cpumask_next'>
        <parameter type-id='95e97e5e'/>
        <parameter type-id='5f8a1ac4'/>
        <return type-id='f0981eeb'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/process.c' language='LANG_C89'>
      <var-decl name='__stack_chk_guard' type-id='7359adad' mangled-name='__stack_chk_guard' visibility='default' filepath='arch/arm64/kernel/process.c' line='62' column='1' elf-symbol-id='__stack_chk_guard'/>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/psci.c' language='LANG_C89'>
      <function-decl name='usleep_range' mangled-name='usleep_range' filepath='include/linux/delay.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='usleep_range'>
        <parameter type-id='7359adad'/>
        <parameter type-id='7359adad'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/setup.c' language='LANG_C89'>
      <class-decl name='atomic_notifier_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/notifier.h' line='60' column='1' id='dbd58f6e'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='include/linux/notifier.h' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='head' type-id='d504f73d' visibility='default' filepath='include/linux/notifier.h' line='62' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='dbd58f6e' size-in-bits='64' id='02162584'/>
      <function-decl name='atomic_notifier_chain_register' mangled-name='atomic_notifier_chain_register' filepath='include/linux/notifier.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_notifier_chain_register'>
        <parameter type-id='02162584'/>
        <parameter type-id='d504f73d'/>
        <return type-id='95e97e5e'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/smp.c' language='LANG_C89'>
      <var-decl name='cpu_number' type-id='95e97e5e' mangled-name='cpu_number' visibility='default' filepath='arch/arm64/kernel/smp.c' line='57' column='1' elf-symbol-id='cpu_number'/>
      <function-decl name='wait_for_completion_timeout' mangled-name='wait_for_completion_timeout' filepath='include/linux/completion.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wait_for_completion_timeout'>
        <parameter type-id='389faaf7'/>
        <parameter type-id='7359adad'/>
        <return type-id='7359adad'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/smp_spin_table.c' language='LANG_C89'>
      <qualified-type-def type-id='48b5725f' volatile='yes' id='b0b3cbf9'/>
      <pointer-type-def type-id='b0b3cbf9' size-in-bits='64' id='fe09dd29'/>
      <function-decl name='iounmap' mangled-name='iounmap' filepath='arch/arm64/include/asm/io.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iounmap'>
        <parameter type-id='fe09dd29'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/kernel/traps.c' language='LANG_C89'>
      <function-decl name='_raw_spin_lock_irqsave' mangled-name='_raw_spin_lock_irqsave' filepath='include/linux/spinlock_api_smp.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_raw_spin_lock_irqsave'>
        <parameter type-id='538ece95'/>
        <return type-id='7359adad'/>
      </function-decl>
      <function-decl name='_raw_spin_unlock_irqrestore' mangled-name='_raw_spin_unlock_irqrestore' filepath='include/linux/spinlock_api_smp.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_raw_spin_unlock_irqrestore'>
        <parameter type-id='538ece95'/>
        <parameter type-id='7359adad'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/lib/delay.c' language='LANG_C89'>
      <function-decl name='__const_udelay' mangled-name='__const_udelay' filepath='arch/arm64/lib/delay.c' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__const_udelay'>
        <parameter type-id='7359adad' name='xloops' filepath='arch/arm64/lib/delay.c' line='43' column='1'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='__udelay' mangled-name='__udelay' filepath='arch/arm64/lib/delay.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__udelay'>
        <parameter type-id='7359adad' name='usecs' filepath='arch/arm64/lib/delay.c' line='49' column='1'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/mm/context.c' language='LANG_C89'>
      <function-decl name='find_next_zero_bit' mangled-name='find_next_zero_bit' filepath='include/asm-generic/bitops/find.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='find_next_zero_bit'>
        <parameter type-id='f9b37274'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='7359adad'/>
        <return type-id='7359adad'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/mm/dma-mapping.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='d3130597' size-in-bits='128' id='8a7b7524'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='96' id='538d6b9f'>
        <subrange length='12' type-id='7ff19f0f' id='84827bdc'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='16' id='0618bc0e'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='448' id='a038344f'>
        <subrange length='56' type-id='7ff19f0f' id='f8137894'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='512' id='625d6c02'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <class-decl name='iommu_ops' size-in-bits='2624' is-struct='yes' visibility='default' filepath='include/linux/iommu.h' line='239' column='1' id='8b7a2cd1'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='capable' type-id='fd03a8f4' visibility='default' filepath='include/linux/iommu.h' line='240' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='domain_alloc' type-id='2908e93a' visibility='default' filepath='include/linux/iommu.h' line='243' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='domain_free' type-id='36caa4da' visibility='default' filepath='include/linux/iommu.h' line='244' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='attach_dev' type-id='21e9ca19' visibility='default' filepath='include/linux/iommu.h' line='246' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='detach_dev' type-id='32baba38' visibility='default' filepath='include/linux/iommu.h' line='247' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='map' type-id='2371b41a' visibility='default' filepath='include/linux/iommu.h' line='248' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='unmap' type-id='d1a6d6c2' visibility='default' filepath='include/linux/iommu.h' line='250' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='flush_iotlb_all' type-id='36caa4da' visibility='default' filepath='include/linux/iommu.h' line='252' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='iotlb_sync_map' type-id='36caa4da' visibility='default' filepath='include/linux/iommu.h' line='253' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='iotlb_sync' type-id='a6bf568c' visibility='default' filepath='include/linux/iommu.h' line='254' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='iova_to_phys' type-id='c4904652' visibility='default' filepath='include/linux/iommu.h' line='256' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='probe_device' type-id='9f2abc7c' visibility='default' filepath='include/linux/iommu.h' line='257' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='release_device' type-id='dd787f72' visibility='default' filepath='include/linux/iommu.h' line='258' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='probe_finalize' type-id='dd787f72' visibility='default' filepath='include/linux/iommu.h' line='259' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='device_group' type-id='5448fdd7' visibility='default' filepath='include/linux/iommu.h' line='260' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='domain_get_attr' type-id='fe396a7b' visibility='default' filepath='include/linux/iommu.h' line='261' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='domain_set_attr' type-id='fe396a7b' visibility='default' filepath='include/linux/iommu.h' line='263' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='get_resv_regions' type-id='83d96d05' visibility='default' filepath='include/linux/iommu.h' line='267' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='put_resv_regions' type-id='83d96d05' visibility='default' filepath='include/linux/iommu.h' line='268' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='apply_resv_region' type-id='b20722ab' visibility='default' filepath='include/linux/iommu.h' line='269' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='domain_window_enable' type-id='7f31e8fb' visibility='default' filepath='include/linux/iommu.h' line='274' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='domain_window_disable' type-id='d3b2d361' visibility='default' filepath='include/linux/iommu.h' line='276' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='of_xlate' type-id='7fc43753' visibility='default' filepath='include/linux/iommu.h' line='278' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='is_attach_deferred' type-id='6ee36fa3' visibility='default' filepath='include/linux/iommu.h' line='279' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='dev_has_feat' type-id='6981b6e9' visibility='default' filepath='include/linux/iommu.h' line='282' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='dev_feat_enabled' type-id='6981b6e9' visibility='default' filepath='include/linux/iommu.h' line='283' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='dev_enable_feat' type-id='5a1281ab' visibility='default' filepath='include/linux/iommu.h' line='284' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='dev_disable_feat' type-id='5a1281ab' visibility='default' filepath='include/linux/iommu.h' line='285' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='aux_attach_dev' type-id='21e9ca19' visibility='default' filepath='include/linux/iommu.h' line='288' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='aux_detach_dev' type-id='32baba38' visibility='default' filepath='include/linux/iommu.h' line='289' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='aux_get_pasid' type-id='21e9ca19' visibility='default' filepath='include/linux/iommu.h' line='290' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='sva_bind' type-id='925b860a' visibility='default' filepath='include/linux/iommu.h' line='292' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='sva_unbind' type-id='4fb74714' visibility='default' filepath='include/linux/iommu.h' line='294' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='sva_get_pasid' type-id='4ded61d5' visibility='default' filepath='include/linux/iommu.h' line='295' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='page_response' type-id='1ff48951' visibility='default' filepath='include/linux/iommu.h' line='297' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='cache_invalidate' type-id='fae741e8' visibility='default' filepath='include/linux/iommu.h' line='300' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='sva_bind_gpasid' type-id='145acfb2' visibility='default' filepath='include/linux/iommu.h' line='302' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='sva_unbind_gpasid' type-id='83ceca5c' visibility='default' filepath='include/linux/iommu.h' line='305' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='def_domain_type' type-id='613d39f5' visibility='default' filepath='include/linux/iommu.h' line='307' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='pgsize_bitmap' type-id='7359adad' visibility='default' filepath='include/linux/iommu.h' line='309' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='owner' type-id='2730d015' visibility='default' filepath='include/linux/iommu.h' line='310' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='iommu_cap' filepath='include/linux/iommu.h' line='98' column='1' id='031224de'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='IOMMU_CAP_CACHE_COHERENCY' value='0'/>
        <enumerator name='IOMMU_CAP_INTR_REMAP' value='1'/>
        <enumerator name='IOMMU_CAP_NOEXEC' value='2'/>
      </enum-decl>
      <class-decl name='iommu_domain' size-in-bits='576' is-struct='yes' visibility='default' filepath='include/linux/iommu.h' line='88' column='1' id='80ef8feb'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='type' type-id='f0981eeb' visibility='default' filepath='include/linux/iommu.h' line='89' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='ops' type-id='f1ac64d0' visibility='default' filepath='include/linux/iommu.h' line='90' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='pgsize_bitmap' type-id='7359adad' visibility='default' filepath='include/linux/iommu.h' line='91' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='handler' type-id='a01c3626' visibility='default' filepath='include/linux/iommu.h' line='92' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='handler_token' type-id='eaa32e2f' visibility='default' filepath='include/linux/iommu.h' line='93' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='geometry' type-id='1f78af0c' visibility='default' filepath='include/linux/iommu.h' line='94' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='iova_cookie' type-id='eaa32e2f' visibility='default' filepath='include/linux/iommu.h' line='95' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='iommu_fault_handler_t' type-id='8e0d1900' filepath='include/linux/iommu.h' line='54' column='1' id='a01c3626'/>
      <class-decl name='iommu_domain_geometry' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/iommu.h' line='58' column='1' id='1f78af0c'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='aperture_start' type-id='cf29c9b3' visibility='default' filepath='include/linux/iommu.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='aperture_end' type-id='cf29c9b3' visibility='default' filepath='include/linux/iommu.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='force_aperture' type-id='b50a4934' visibility='default' filepath='include/linux/iommu.h' line='61' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='iommu_iotlb_gather' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/iommu.h' line='185' column='1' id='34fc4897'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='start' type-id='7359adad' visibility='default' filepath='include/linux/iommu.h' line='186' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='end' type-id='7359adad' visibility='default' filepath='include/linux/iommu.h' line='187' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='pgsize' type-id='b59d7dce' visibility='default' filepath='include/linux/iommu.h' line='188' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='iommu_device' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/iommu.h' line='320' column='1' id='c67e920d'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='list' type-id='72f469ec' visibility='default' filepath='include/linux/iommu.h' line='321' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='ops' type-id='f1ac64d0' visibility='default' filepath='include/linux/iommu.h' line='322' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='fwnode' type-id='4a935625' visibility='default' filepath='include/linux/iommu.h' line='323' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='dev' type-id='fa0b179b' visibility='default' filepath='include/linux/iommu.h' line='324' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='iommu_attr' filepath='include/linux/iommu.h' line='118' column='1' id='e176cc45'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='DOMAIN_ATTR_GEOMETRY' value='0'/>
        <enumerator name='DOMAIN_ATTR_PAGING' value='1'/>
        <enumerator name='DOMAIN_ATTR_WINDOWS' value='2'/>
        <enumerator name='DOMAIN_ATTR_FSL_PAMU_STASH' value='3'/>
        <enumerator name='DOMAIN_ATTR_FSL_PAMU_ENABLE' value='4'/>
        <enumerator name='DOMAIN_ATTR_FSL_PAMUV1' value='5'/>
        <enumerator name='DOMAIN_ATTR_NESTING' value='6'/>
        <enumerator name='DOMAIN_ATTR_DMA_USE_FLUSH_QUEUE' value='7'/>
        <enumerator name='DOMAIN_ATTR_MAX' value='8'/>
      </enum-decl>
      <class-decl name='iommu_resv_region' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/iommu.h' line='156' column='1' id='91088608'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='list' type-id='72f469ec' visibility='default' filepath='include/linux/iommu.h' line='157' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='start' type-id='2522883d' visibility='default' filepath='include/linux/iommu.h' line='158' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='length' type-id='b59d7dce' visibility='default' filepath='include/linux/iommu.h' line='159' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='prot' type-id='95e97e5e' visibility='default' filepath='include/linux/iommu.h' line='160' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='288'>
          <var-decl name='type' type-id='256c2037' visibility='default' filepath='include/linux/iommu.h' line='161' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='iommu_resv_type' filepath='include/linux/iommu.h' line='131' column='1' id='256c2037'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='IOMMU_RESV_DIRECT' value='0'/>
        <enumerator name='IOMMU_RESV_DIRECT_RELAXABLE' value='1'/>
        <enumerator name='IOMMU_RESV_RESERVED' value='2'/>
        <enumerator name='IOMMU_RESV_MSI' value='3'/>
        <enumerator name='IOMMU_RESV_SW_MSI' value='4'/>
      </enum-decl>
      <class-decl name='of_phandle_args' size-in-bits='640' is-struct='yes' visibility='default' filepath='include/linux/of.h' line='74' column='1' id='fbff4263'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='np' type-id='9a537bbe' visibility='default' filepath='include/linux/of.h' line='75' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='args_count' type-id='95e97e5e' visibility='default' filepath='include/linux/of.h' line='76' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='args' type-id='625d6c02' visibility='default' filepath='include/linux/of.h' line='77' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='iommu_dev_features' filepath='include/linux/iommu.h' line='165' column='1' id='29d28711'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='IOMMU_DEV_FEAT_AUX' value='0'/>
        <enumerator name='IOMMU_DEV_FEAT_SVA' value='1'/>
      </enum-decl>
      <class-decl name='iommu_sva' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/iommu.h' line='610' column='1' id='c0e44fcd'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='dev' type-id='fa0b179b' visibility='default' filepath='include/linux/iommu.h' line='611' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='iommu_fault_event' size-in-bits='640' is-struct='yes' visibility='default' filepath='include/linux/iommu.h' line='336' column='1' id='00f37356'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='fault' type-id='1f190221' visibility='default' filepath='include/linux/iommu.h' line='337' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='list' type-id='72f469ec' visibility='default' filepath='include/linux/iommu.h' line='338' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='iommu_fault' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/uapi/linux/iommu.h' line='111' column='1' id='1f190221'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='type' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='112' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='padding' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='113' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='' type-id='ac5ab595' visibility='default' filepath='include/uapi/linux/iommu.h' line='114' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__' size-in-bits='448' is-anonymous='yes' visibility='default' filepath='include/uapi/linux/iommu.h' line='114' column='1' id='ac5ab595'>
        <data-member access='private'>
          <var-decl name='event' type-id='85fb8e73' visibility='default' filepath='include/uapi/linux/iommu.h' line='115' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='prm' type-id='cfbe6297' visibility='default' filepath='include/uapi/linux/iommu.h' line='116' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='padding2' type-id='a038344f' visibility='default' filepath='include/uapi/linux/iommu.h' line='117' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='iommu_fault_unrecoverable' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/uapi/linux/iommu.h' line='69' column='1' id='85fb8e73'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='reason' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='70' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='flags' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='pasid' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='75' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='perm' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='76' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='addr' type-id='d3130597' visibility='default' filepath='include/uapi/linux/iommu.h' line='77' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='fetch_addr' type-id='d3130597' visibility='default' filepath='include/uapi/linux/iommu.h' line='78' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='iommu_fault_page_request' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/uapi/linux/iommu.h' line='91' column='1' id='cfbe6297'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='flags' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='95' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='pasid' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='96' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='grpid' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='97' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='perm' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='98' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='addr' type-id='d3130597' visibility='default' filepath='include/uapi/linux/iommu.h' line='99' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='private_data' type-id='8a7b7524' visibility='default' filepath='include/uapi/linux/iommu.h' line='100' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='iommu_page_response' size-in-bits='160' is-struct='yes' visibility='default' filepath='include/uapi/linux/iommu.h' line='145' column='1' id='719148b2'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='version' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='147' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='flags' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='149' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='pasid' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='150' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='grpid' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='151' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='code' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='152' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='iommu_cache_invalidate_info' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/uapi/linux/iommu.h' line='248' column='1' id='8a6b39f6'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='version' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='250' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='cache' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/iommu.h' line='256' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='40'>
          <var-decl name='granularity' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/iommu.h' line='257' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='48'>
          <var-decl name='padding' type-id='0618bc0e' visibility='default' filepath='include/uapi/linux/iommu.h' line='258' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='' type-id='f6cbf12c' visibility='default' filepath='include/uapi/linux/iommu.h' line='259' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__1' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='include/uapi/linux/iommu.h' line='259' column='1' id='f6cbf12c'>
        <data-member access='private'>
          <var-decl name='pasid_info' type-id='daf9a599' visibility='default' filepath='include/uapi/linux/iommu.h' line='260' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='addr_info' type-id='d8e8de01' visibility='default' filepath='include/uapi/linux/iommu.h' line='261' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='iommu_inv_pasid_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/uapi/linux/iommu.h' line='210' column='1' id='daf9a599'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='flags' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='213' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='archid' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='214' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='pasid' type-id='d3130597' visibility='default' filepath='include/uapi/linux/iommu.h' line='215' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='iommu_inv_addr_info' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/uapi/linux/iommu.h' line='183' column='1' id='d8e8de01'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='flags' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='187' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='archid' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='188' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='pasid' type-id='d3130597' visibility='default' filepath='include/uapi/linux/iommu.h' line='189' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='addr' type-id='d3130597' visibility='default' filepath='include/uapi/linux/iommu.h' line='190' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='granule_size' type-id='d3130597' visibility='default' filepath='include/uapi/linux/iommu.h' line='191' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='nb_granules' type-id='d3130597' visibility='default' filepath='include/uapi/linux/iommu.h' line='192' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='iommu_gpasid_bind_data' size-in-bits='576' is-struct='yes' visibility='default' filepath='include/uapi/linux/iommu.h' line='311' column='1' id='10edb5fe'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='version' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='313' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='format' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='315' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='flags' type-id='d3130597' visibility='default' filepath='include/uapi/linux/iommu.h' line='317' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='gpgd' type-id='d3130597' visibility='default' filepath='include/uapi/linux/iommu.h' line='318' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='hpasid' type-id='d3130597' visibility='default' filepath='include/uapi/linux/iommu.h' line='319' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='gpasid' type-id='d3130597' visibility='default' filepath='include/uapi/linux/iommu.h' line='320' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='addr_width' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='321' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='352'>
          <var-decl name='padding' type-id='538d6b9f' visibility='default' filepath='include/uapi/linux/iommu.h' line='322' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='' type-id='f9cbf5e6' visibility='default' filepath='include/uapi/linux/iommu.h' line='324' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__2' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='include/uapi/linux/iommu.h' line='324' column='1' id='f9cbf5e6'>
        <data-member access='private'>
          <var-decl name='vtd' type-id='8b85ffcf' visibility='default' filepath='include/uapi/linux/iommu.h' line='325' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='iommu_gpasid_bind_data_vtd' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/uapi/linux/iommu.h' line='276' column='1' id='8b85ffcf'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='flags' type-id='d3130597' visibility='default' filepath='include/uapi/linux/iommu.h' line='283' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='pat' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='284' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='emt' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='285' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='iommu_fault_param' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/linux/iommu.h' line='348' column='1' id='325adc8b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='handler' type-id='a84f5b46' visibility='default' filepath='include/linux/iommu.h' line='349' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='include/linux/iommu.h' line='350' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='faults' type-id='72f469ec' visibility='default' filepath='include/linux/iommu.h' line='351' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='lock' type-id='925167dc' visibility='default' filepath='include/linux/iommu.h' line='352' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='iommu_dev_fault_handler_t' type-id='6d118cd1' filepath='include/linux/iommu.h' line='56' column='1' id='a84f5b46'/>
      <class-decl name='iommu_fwspec' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/iommu.h' line='595' column='1' id='0d6f83ff'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='ops' type-id='f1ac64d0' visibility='default' filepath='include/linux/iommu.h' line='596' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='iommu_fwnode' type-id='4a935625' visibility='default' filepath='include/linux/iommu.h' line='597' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='flags' type-id='19c2251e' visibility='default' filepath='include/linux/iommu.h' line='598' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='num_pasid_bits' type-id='19c2251e' visibility='default' filepath='include/linux/iommu.h' line='599' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='num_ids' type-id='f0981eeb' visibility='default' filepath='include/linux/iommu.h' line='600' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='ids' type-id='c165e8b9' visibility='default' filepath='include/linux/iommu.h' line='601' column='1'/>
        </data-member>
      </class-decl>
      <qualified-type-def type-id='8b7a2cd1' const='yes' id='9ce849da'/>
      <pointer-type-def type-id='9ce849da' size-in-bits='64' id='f1ac64d0'/>
      <pointer-type-def type-id='46816f8f' size-in-bits='64' id='5a1281ab'/>
      <pointer-type-def type-id='889b68aa' size-in-bits='64' id='83ceca5c'/>
      <pointer-type-def type-id='984b30c5' size-in-bits='64' id='1ff48951'/>
      <pointer-type-def type-id='0ebe5367' size-in-bits='64' id='7fc43753'/>
      <pointer-type-def type-id='0ef3e0fd' size-in-bits='64' id='21e9ca19'/>
      <pointer-type-def type-id='e215eeb6' size-in-bits='64' id='fae741e8'/>
      <pointer-type-def type-id='5f7638f8' size-in-bits='64' id='145acfb2'/>
      <pointer-type-def type-id='bdb68106' size-in-bits='64' id='8e0d1900'/>
      <pointer-type-def type-id='f11f5d07' size-in-bits='64' id='fe396a7b'/>
      <pointer-type-def type-id='99373687' size-in-bits='64' id='7f31e8fb'/>
      <pointer-type-def type-id='c619ce98' size-in-bits='64' id='2371b41a'/>
      <pointer-type-def type-id='9bb659f5' size-in-bits='64' id='6d118cd1'/>
      <pointer-type-def type-id='dab705c1' size-in-bits='64' id='4ded61d5'/>
      <pointer-type-def type-id='8a6b39f6' size-in-bits='64' id='597277ac'/>
      <pointer-type-def type-id='c67e920d' size-in-bits='64' id='2f00283d'/>
      <pointer-type-def type-id='eab6ec52' size-in-bits='64' id='9f2abc7c'/>
      <pointer-type-def type-id='80ef8feb' size-in-bits='64' id='bff05edb'/>
      <pointer-type-def type-id='78536370' size-in-bits='64' id='2908e93a'/>
      <pointer-type-def type-id='1f190221' size-in-bits='64' id='9d9e2a39'/>
      <pointer-type-def type-id='00f37356' size-in-bits='64' id='af233abc'/>
      <pointer-type-def type-id='325adc8b' size-in-bits='64' id='0a9b173b'/>
      <pointer-type-def type-id='0d6f83ff' size-in-bits='64' id='1979c577'/>
      <pointer-type-def type-id='10edb5fe' size-in-bits='64' id='b3240f74'/>
      <pointer-type-def type-id='834d1a2b' size-in-bits='64' id='5448fdd7'/>
      <pointer-type-def type-id='34fc4897' size-in-bits='64' id='1c63cc3f'/>
      <pointer-type-def type-id='719148b2' size-in-bits='64' id='de4fef50'/>
      <pointer-type-def type-id='91088608' size-in-bits='64' id='24b0cc5e'/>
      <pointer-type-def type-id='c0e44fcd' size-in-bits='64' id='419266fd'/>
      <pointer-type-def type-id='a2dba6b8' size-in-bits='64' id='925b860a'/>
      <pointer-type-def type-id='fbff4263' size-in-bits='64' id='51a94113'/>
      <pointer-type-def type-id='24f3731d' size-in-bits='64' id='6981b6e9'/>
      <pointer-type-def type-id='b3bc5b3a' size-in-bits='64' id='fd03a8f4'/>
      <pointer-type-def type-id='53143c97' size-in-bits='64' id='6ee36fa3'/>
      <pointer-type-def type-id='7a348508' size-in-bits='64' id='c4904652'/>
      <pointer-type-def type-id='f1a922f0' size-in-bits='64' id='d1a6d6c2'/>
      <pointer-type-def type-id='6c99ab8f' size-in-bits='64' id='b20722ab'/>
      <pointer-type-def type-id='06a1c469' size-in-bits='64' id='83d96d05'/>
      <pointer-type-def type-id='0b1ef2a8' size-in-bits='64' id='36caa4da'/>
      <pointer-type-def type-id='e931abd6' size-in-bits='64' id='32baba38'/>
      <pointer-type-def type-id='87769f42' size-in-bits='64' id='a6bf568c'/>
      <pointer-type-def type-id='e5507ab5' size-in-bits='64' id='d3b2d361'/>
      <pointer-type-def type-id='22400b6a' size-in-bits='64' id='4fb74714'/>
      <function-decl name='dev_driver_string' mangled-name='dev_driver_string' filepath='include/linux/device.h' line='964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dev_driver_string'>
        <parameter type-id='8df61054'/>
        <return type-id='80f4b756'/>
      </function-decl>
      <function-type size-in-bits='64' id='46816f8f'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='29d28711'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='889b68aa'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='984b30c5'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='af233abc'/>
        <parameter type-id='de4fef50'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='0ebe5367'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='51a94113'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='0ef3e0fd'>
        <parameter type-id='bff05edb'/>
        <parameter type-id='fa0b179b'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='e215eeb6'>
        <parameter type-id='bff05edb'/>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='597277ac'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='5f7638f8'>
        <parameter type-id='bff05edb'/>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='b3240f74'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='bdb68106'>
        <parameter type-id='bff05edb'/>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='95e97e5e'/>
        <parameter type-id='eaa32e2f'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='f11f5d07'>
        <parameter type-id='bff05edb'/>
        <parameter type-id='e176cc45'/>
        <parameter type-id='eaa32e2f'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='99373687'>
        <parameter type-id='bff05edb'/>
        <parameter type-id='19c2251e'/>
        <parameter type-id='2522883d'/>
        <parameter type-id='91ce1af9'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='c619ce98'>
        <parameter type-id='bff05edb'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='2522883d'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='95e97e5e'/>
        <parameter type-id='3eb7c31c'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='9bb659f5'>
        <parameter type-id='9d9e2a39'/>
        <parameter type-id='eaa32e2f'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='dab705c1'>
        <parameter type-id='419266fd'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='eab6ec52'>
        <parameter type-id='fa0b179b'/>
        <return type-id='2f00283d'/>
      </function-type>
      <function-type size-in-bits='64' id='78536370'>
        <parameter type-id='f0981eeb'/>
        <return type-id='bff05edb'/>
      </function-type>
      <function-type size-in-bits='64' id='834d1a2b'>
        <parameter type-id='fa0b179b'/>
        <return type-id='0b19fc54'/>
      </function-type>
      <function-type size-in-bits='64' id='a2dba6b8'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='df4b7819'/>
        <parameter type-id='eaa32e2f'/>
        <return type-id='419266fd'/>
      </function-type>
      <function-type size-in-bits='64' id='24f3731d'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='29d28711'/>
        <return type-id='b50a4934'/>
      </function-type>
      <function-type size-in-bits='64' id='b3bc5b3a'>
        <parameter type-id='031224de'/>
        <return type-id='b50a4934'/>
      </function-type>
      <function-type size-in-bits='64' id='53143c97'>
        <parameter type-id='bff05edb'/>
        <parameter type-id='fa0b179b'/>
        <return type-id='b50a4934'/>
      </function-type>
      <function-type size-in-bits='64' id='7a348508'>
        <parameter type-id='bff05edb'/>
        <parameter type-id='cf29c9b3'/>
        <return type-id='2522883d'/>
      </function-type>
      <function-type size-in-bits='64' id='f1a922f0'>
        <parameter type-id='bff05edb'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='1c63cc3f'/>
        <return type-id='b59d7dce'/>
      </function-type>
      <function-type size-in-bits='64' id='6c99ab8f'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='bff05edb'/>
        <parameter type-id='24b0cc5e'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='06a1c469'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='e84b031a'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='0b1ef2a8'>
        <parameter type-id='bff05edb'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='e931abd6'>
        <parameter type-id='bff05edb'/>
        <parameter type-id='fa0b179b'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='87769f42'>
        <parameter type-id='bff05edb'/>
        <parameter type-id='1c63cc3f'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='e5507ab5'>
        <parameter type-id='bff05edb'/>
        <parameter type-id='19c2251e'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='22400b6a'>
        <parameter type-id='419266fd'/>
        <return type-id='48b5725f'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/mm/init.c' language='LANG_C89'>
      <var-decl name='physvirt_offset' type-id='9b7c55ef' mangled-name='physvirt_offset' visibility='default' filepath='arch/arm64/mm/init.c' line='57' column='1' elf-symbol-id='physvirt_offset'/>
      <var-decl name='vmemmap' type-id='02f11ed4' mangled-name='vmemmap' visibility='default' filepath='arch/arm64/mm/init.c' line='60' column='1' elf-symbol-id='vmemmap'/>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/mm/ioremap.c' language='LANG_C89'>
      <function-decl name='__ioremap' mangled-name='__ioremap' filepath='arch/arm64/mm/ioremap.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ioremap'>
        <parameter type-id='2522883d' name='phys_addr' filepath='arch/arm64/mm/ioremap.c' line='65' column='1'/>
        <parameter type-id='b59d7dce' name='size' filepath='arch/arm64/mm/ioremap.c' line='65' column='1'/>
        <parameter type-id='2e2dcbd3' name='prot' filepath='arch/arm64/mm/ioremap.c' line='65' column='1'/>
        <return type-id='eaa32e2f'/>
      </function-decl>
      <function-decl name='is_vmalloc_addr' mangled-name='is_vmalloc_addr' filepath='include/linux/mm.h' line='737' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_vmalloc_addr'>
        <parameter type-id='eaa32e2f'/>
        <return type-id='c894953d'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='arch/arm64/mm/mmu.c' language='LANG_C89'>
      <var-decl name='vabits_actual' type-id='91ce1af9' mangled-name='vabits_actual' visibility='default' filepath='arch/arm64/mm/mmu.c' line='45' column='1' elf-symbol-id='vabits_actual'/>
      <var-decl name='kimage_voffset' type-id='91ce1af9' mangled-name='kimage_voffset' visibility='default' filepath='arch/arm64/mm/mmu.c' line='48' column='1' elf-symbol-id='kimage_voffset'/>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/badblocks.c' language='LANG_C89'>
      <function-decl name='devm_kfree' mangled-name='devm_kfree' filepath='include/linux/device.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='devm_kfree'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='eaa32e2f'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/blk-ioc.c' language='LANG_C89'>
      <function-decl name='radix_tree_maybe_preload' mangled-name='radix_tree_maybe_preload' filepath='include/linux/radix-tree.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='radix_tree_maybe_preload'>
        <parameter type-id='f0981eeb'/>
        <return type-id='95e97e5e'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='block/bsg.c' language='LANG_C89'>
      <function-decl name='class_destroy' mangled-name='class_destroy' filepath='include/linux/device/class.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='class_destroy'>
        <parameter type-id='67aca04f'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='crypto/rsa-pkcs1pad.c' language='LANG_C89'>
      <function-decl name='sg_pcopy_to_buffer' mangled-name='sg_pcopy_to_buffer' filepath='include/linux/scatterlist.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sg_pcopy_to_buffer'>
        <parameter type-id='bf3ef905'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='bd54fe1a'/>
        <return type-id='7359adad'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/class.c' language='LANG_C89'>
      <class-decl name='device_private' size-in-bits='1664' is-struct='yes' visibility='default' filepath='drivers/base/base.h' line='88' column='1' id='d066d157'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='klist_children' type-id='6160a6ce' visibility='default' filepath='drivers/base/base.h' line='89' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='knode_parent' type-id='3d045a53' visibility='default' filepath='drivers/base/base.h' line='90' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='knode_driver' type-id='3d045a53' visibility='default' filepath='drivers/base/base.h' line='91' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='knode_bus' type-id='3d045a53' visibility='default' filepath='drivers/base/base.h' line='92' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='knode_class' type-id='3d045a53' visibility='default' filepath='drivers/base/base.h' line='93' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='deferred_probe' type-id='72f469ec' visibility='default' filepath='drivers/base/base.h' line='94' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='async_driver' type-id='00c7b870' visibility='default' filepath='drivers/base/base.h' line='95' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='device' type-id='fa0b179b' visibility='default' filepath='drivers/base/base.h' line='96' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7'>
          <var-decl name='dead' type-id='f9b06939' visibility='default' filepath='drivers/base/base.h' line='97' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='klist' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/klist.h' line='18' column='1' id='6160a6ce'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='k_lock' type-id='fb4018a0' visibility='default' filepath='include/linux/klist.h' line='19' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='k_list' type-id='72f469ec' visibility='default' filepath='include/linux/klist.h' line='20' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='get' type-id='a80942ae' visibility='default' filepath='include/linux/klist.h' line='21' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='put' type-id='a80942ae' visibility='default' filepath='include/linux/klist.h' line='22' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='klist_node' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/klist.h' line='37' column='1' id='3d045a53'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='n_klist' type-id='eaa32e2f' visibility='default' filepath='include/linux/klist.h' line='38' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='n_node' type-id='72f469ec' visibility='default' filepath='include/linux/klist.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='n_ref' type-id='400fb07b' visibility='default' filepath='include/linux/klist.h' line='40' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='driver_private' size-in-bits='1216' is-struct='yes' visibility='default' filepath='drivers/base/base.h' line='58' column='1' id='e44b8083'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='kobj' type-id='b6ab8849' visibility='default' filepath='drivers/base/base.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='klist_devices' type-id='6160a6ce' visibility='default' filepath='drivers/base/base.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='knode_bus' type-id='3d045a53' visibility='default' filepath='drivers/base/base.h' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='mkobj' type-id='47ed147a' visibility='default' filepath='drivers/base/base.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='driver' type-id='00c7b870' visibility='default' filepath='drivers/base/base.h' line='63' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='d066d157' size-in-bits='64' id='0d3b0dcf'/>
      <pointer-type-def type-id='e44b8083' size-in-bits='64' id='52abf1d3'/>
      <pointer-type-def type-id='3d045a53' size-in-bits='64' id='4b4b90b3'/>
      <pointer-type-def type-id='b3fff074' size-in-bits='64' id='a80942ae'/>
      <function-decl name='__class_create' mangled-name='__class_create' filepath='drivers/base/class.c' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__class_create'>
        <parameter type-id='2730d016' name='owner' filepath='drivers/base/class.c' line='226' column='1'/>
        <parameter type-id='80f4b756' name='name' filepath='drivers/base/class.c' line='226' column='1'/>
        <parameter type-id='a57283f9' name='key' filepath='drivers/base/class.c' line='227' column='1'/>
        <return type-id='67aca04f'/>
      </function-decl>
      <function-type size-in-bits='64' id='b3fff074'>
        <parameter type-id='4b4b90b3'/>
        <return type-id='48b5725f'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/cpu.c' language='LANG_C89'>
      <var-decl name='cpu_subsys' type-id='b31bfc8a' mangled-name='cpu_subsys' visibility='default' filepath='drivers/base/cpu.c' line='128' column='1' elf-symbol-id='cpu_subsys'/>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/platform.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='80f4b756' size-in-bits='64' id='75e4a9bd'>
        <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='1dc6a898' size-in-bits='64' id='02580c2f'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='64' id='1872161b'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='64' id='64a61909'>
        <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
      </array-type-def>
      <class-decl name='property_entry' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/property.h' line='250' column='1' id='822bf95b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/property.h' line='251' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='length' type-id='b59d7dce' visibility='default' filepath='include/linux/property.h' line='252' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='is_inline' type-id='b50a4934' visibility='default' filepath='include/linux/property.h' line='253' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='type' type-id='fec738e2' visibility='default' filepath='include/linux/property.h' line='254' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='' type-id='ac5ab596' visibility='default' filepath='include/linux/property.h' line='255' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='dev_prop_type' filepath='include/linux/property.h' line='19' column='1' id='fec738e2'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='DEV_PROP_U8' value='0'/>
        <enumerator name='DEV_PROP_U16' value='1'/>
        <enumerator name='DEV_PROP_U32' value='2'/>
        <enumerator name='DEV_PROP_U64' value='3'/>
        <enumerator name='DEV_PROP_STRING' value='4'/>
        <enumerator name='DEV_PROP_REF' value='5'/>
      </enum-decl>
      <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/property.h' line='255' column='1' id='ac5ab596'>
        <data-member access='private'>
          <var-decl name='pointer' type-id='eaa32e2f' visibility='default' filepath='include/linux/property.h' line='256' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='value' type-id='f6cbf12d' visibility='default' filepath='include/linux/property.h' line='263' column='1'/>
        </data-member>
      </union-decl>
      <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/property.h' line='257' column='1' id='f6cbf12d'>
        <data-member access='private'>
          <var-decl name='u8_data' type-id='d2f7b56a' visibility='default' filepath='include/linux/property.h' line='258' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='u16_data' type-id='02580c2f' visibility='default' filepath='include/linux/property.h' line='259' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='u32_data' type-id='1872161b' visibility='default' filepath='include/linux/property.h' line='260' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='u64_data' type-id='64a61909' visibility='default' filepath='include/linux/property.h' line='261' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='str' type-id='75e4a9bd' visibility='default' filepath='include/linux/property.h' line='262' column='1'/>
        </data-member>
      </union-decl>
      <qualified-type-def type-id='822bf95b' const='yes' id='283e536e'/>
      <pointer-type-def type-id='283e536e' size-in-bits='64' id='9e1d140c'/>
      <pointer-type-def type-id='c9d64c0d' size-in-bits='64' id='e359e165'/>
      <function-decl name='devm_platform_get_and_ioremap_resource' mangled-name='devm_platform_get_and_ioremap_resource' filepath='drivers/base/platform.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='devm_platform_get_and_ioremap_resource'>
        <parameter type-id='db362995' name='pdev' filepath='drivers/base/platform.c' line='75' column='1'/>
        <parameter type-id='f0981eeb' name='index' filepath='drivers/base/platform.c' line='76' column='1'/>
        <parameter type-id='e359e165' name='res' filepath='drivers/base/platform.c' line='76' column='1'/>
        <return type-id='eaa32e2f'/>
      </function-decl>
      <function-decl name='platform_device_add_resources' mangled-name='platform_device_add_resources' filepath='drivers/base/platform.c' line='468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='platform_device_add_resources'>
        <parameter type-id='db362995' name='pdev' filepath='drivers/base/platform.c' line='468' column='1'/>
        <parameter type-id='e153f6de' name='res' filepath='drivers/base/platform.c' line='469' column='1'/>
        <parameter type-id='f0981eeb' name='num' filepath='drivers/base/platform.c' line='469' column='1'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='platform_device_add_properties' mangled-name='platform_device_add_properties' filepath='drivers/base/platform.c' line='522' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='platform_device_add_properties'>
        <parameter type-id='db362995' name='pdev' filepath='drivers/base/platform.c' line='522' column='1'/>
        <parameter type-id='9e1d140c' name='properties' filepath='drivers/base/platform.c' line='523' column='1'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='__platform_driver_register' mangled-name='__platform_driver_register' filepath='drivers/base/platform.c' line='793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__platform_driver_register'>
        <parameter type-id='d53c2eb5' name='drv' filepath='drivers/base/platform.c' line='793' column='1'/>
        <parameter type-id='2730d016' name='owner' filepath='drivers/base/platform.c' line='794' column='1'/>
        <return type-id='95e97e5e'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/power/domain.c' language='LANG_C89'>
      <class-decl name='dev_pm_opp' is-struct='yes' visibility='default' is-declaration-only='yes' id='3ba81dd0'/>
      <class-decl name='opp_table' is-struct='yes' visibility='default' is-declaration-only='yes' id='08aeec0d'/>
      <class-decl name='generic_pm_domain' size-in-bits='10624' is-struct='yes' visibility='default' filepath='include/linux/pm_domain.h' line='94' column='1' id='d52c7591'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='dev' type-id='66e487eb' visibility='default' filepath='include/linux/pm_domain.h' line='95' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6144'>
          <var-decl name='domain' type-id='7c94eaa3' visibility='default' filepath='include/linux/pm_domain.h' line='96' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7936'>
          <var-decl name='gpd_list_node' type-id='72f469ec' visibility='default' filepath='include/linux/pm_domain.h' line='97' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8064'>
          <var-decl name='parent_links' type-id='72f469ec' visibility='default' filepath='include/linux/pm_domain.h' line='98' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8192'>
          <var-decl name='child_links' type-id='72f469ec' visibility='default' filepath='include/linux/pm_domain.h' line='99' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8320'>
          <var-decl name='dev_list' type-id='72f469ec' visibility='default' filepath='include/linux/pm_domain.h' line='100' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8448'>
          <var-decl name='gov' type-id='5db9bd89' visibility='default' filepath='include/linux/pm_domain.h' line='101' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8512'>
          <var-decl name='power_off_work' type-id='ef9025d0' visibility='default' filepath='include/linux/pm_domain.h' line='102' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8768'>
          <var-decl name='provider' type-id='4a935625' visibility='default' filepath='include/linux/pm_domain.h' line='103' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8832'>
          <var-decl name='has_provider' type-id='b50a4934' visibility='default' filepath='include/linux/pm_domain.h' line='104' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8896'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/pm_domain.h' line='105' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8960'>
          <var-decl name='sd_count' type-id='49178f86' visibility='default' filepath='include/linux/pm_domain.h' line='106' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8992'>
          <var-decl name='status' type-id='8c497ed4' visibility='default' filepath='include/linux/pm_domain.h' line='107' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9024'>
          <var-decl name='device_count' type-id='f0981eeb' visibility='default' filepath='include/linux/pm_domain.h' line='108' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9056'>
          <var-decl name='suspended_count' type-id='f0981eeb' visibility='default' filepath='include/linux/pm_domain.h' line='109' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9088'>
          <var-decl name='prepared_count' type-id='f0981eeb' visibility='default' filepath='include/linux/pm_domain.h' line='110' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9120'>
          <var-decl name='performance_state' type-id='f0981eeb' visibility='default' filepath='include/linux/pm_domain.h' line='111' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9152'>
          <var-decl name='cpus' type-id='b16b461b' visibility='default' filepath='include/linux/pm_domain.h' line='112' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9216'>
          <var-decl name='power_off' type-id='16052051' visibility='default' filepath='include/linux/pm_domain.h' line='113' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9280'>
          <var-decl name='power_on' type-id='16052051' visibility='default' filepath='include/linux/pm_domain.h' line='114' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9344'>
          <var-decl name='opp_table' type-id='e62a60bd' visibility='default' filepath='include/linux/pm_domain.h' line='115' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9408'>
          <var-decl name='opp_to_performance_state' type-id='0adcd7cb' visibility='default' filepath='include/linux/pm_domain.h' line='116' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9472'>
          <var-decl name='set_performance_state' type-id='791b4a6b' visibility='default' filepath='include/linux/pm_domain.h' line='118' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9536'>
          <var-decl name='dev_ops' type-id='e56d1ecd' visibility='default' filepath='include/linux/pm_domain.h' line='120' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9664'>
          <var-decl name='max_off_time_ns' type-id='9b7c55ef' visibility='default' filepath='include/linux/pm_domain.h' line='121' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9728'>
          <var-decl name='max_off_time_changed' type-id='b50a4934' visibility='default' filepath='include/linux/pm_domain.h' line='122' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9736'>
          <var-decl name='cached_power_down_ok' type-id='b50a4934' visibility='default' filepath='include/linux/pm_domain.h' line='123' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9744'>
          <var-decl name='cached_power_down_state_idx' type-id='b50a4934' visibility='default' filepath='include/linux/pm_domain.h' line='124' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9792'>
          <var-decl name='attach_dev' type-id='9ab734dd' visibility='default' filepath='include/linux/pm_domain.h' line='125' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9856'>
          <var-decl name='detach_dev' type-id='c24523fe' visibility='default' filepath='include/linux/pm_domain.h' line='127' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9920'>
          <var-decl name='flags' type-id='f0981eeb' visibility='default' filepath='include/linux/pm_domain.h' line='129' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9984'>
          <var-decl name='states' type-id='ab59ee31' visibility='default' filepath='include/linux/pm_domain.h' line='130' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10048'>
          <var-decl name='free_states' type-id='28773d52' visibility='default' filepath='include/linux/pm_domain.h' line='131' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10112'>
          <var-decl name='state_count' type-id='f0981eeb' visibility='default' filepath='include/linux/pm_domain.h' line='133' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10144'>
          <var-decl name='state_idx' type-id='f0981eeb' visibility='default' filepath='include/linux/pm_domain.h' line='134' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10176'>
          <var-decl name='on_time' type-id='fbc017ef' visibility='default' filepath='include/linux/pm_domain.h' line='135' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10240'>
          <var-decl name='accounting_time' type-id='fbc017ef' visibility='default' filepath='include/linux/pm_domain.h' line='136' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10304'>
          <var-decl name='lock_ops' type-id='adbc0a2b' visibility='default' filepath='include/linux/pm_domain.h' line='137' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10368'>
          <var-decl name='' type-id='ac5ab597' visibility='default' filepath='include/linux/pm_domain.h' line='138' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='dev_power_governor' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/pm_domain.h' line='71' column='1' id='3e115181'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='power_down_ok' type-id='cb27da0d' visibility='default' filepath='include/linux/pm_domain.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='suspend_ok' type-id='df4bf537' visibility='default' filepath='include/linux/pm_domain.h' line='73' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='gpd_status' filepath='include/linux/pm_domain.h' line='66' column='1' id='8c497ed4'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='GPD_STATE_ACTIVE' value='0'/>
        <enumerator name='GPD_STATE_POWER_OFF' value='1'/>
      </enum-decl>
      <class-decl name='gpd_dev_ops' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/pm_domain.h' line='76' column='1' id='e56d1ecd'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='start' type-id='613d39f5' visibility='default' filepath='include/linux/pm_domain.h' line='77' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='stop' type-id='613d39f5' visibility='default' filepath='include/linux/pm_domain.h' line='78' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='genpd_power_state' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/linux/pm_domain.h' line='81' column='1' id='d5e6c299'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='power_off_latency_ns' type-id='9b7c55ef' visibility='default' filepath='include/linux/pm_domain.h' line='82' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='power_on_latency_ns' type-id='9b7c55ef' visibility='default' filepath='include/linux/pm_domain.h' line='83' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='residency_ns' type-id='9b7c55ef' visibility='default' filepath='include/linux/pm_domain.h' line='84' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='fwnode' type-id='4a935625' visibility='default' filepath='include/linux/pm_domain.h' line='85' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='idle_time' type-id='fbc017ef' visibility='default' filepath='include/linux/pm_domain.h' line='86' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='include/linux/pm_domain.h' line='87' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='genpd_lock_ops' size-in-bits='256' is-struct='yes' visibility='default' filepath='drivers/base/power/domain.c' line='44' column='1' id='4c993ea6'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lock' type-id='cccdf8f0' visibility='default' filepath='drivers/base/power/domain.c' line='45' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='lock_nested' type-id='795e6e5f' visibility='default' filepath='drivers/base/power/domain.c' line='46' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='lock_interruptible' type-id='16052051' visibility='default' filepath='drivers/base/power/domain.c' line='47' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='unlock' type-id='cccdf8f0' visibility='default' filepath='drivers/base/power/domain.c' line='48' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__' size-in-bits='256' is-anonymous='yes' visibility='default' filepath='include/linux/pm_domain.h' line='138' column='1' id='ac5ab597'>
        <data-member access='private'>
          <var-decl name='mlock' type-id='925167dc' visibility='default' filepath='include/linux/pm_domain.h' line='139' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='' type-id='e7f43f73' visibility='default' filepath='include/linux/pm_domain.h' line='140' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='include/linux/pm_domain.h' line='140' column='1' id='e7f43f73'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='slock' type-id='fb4018a0' visibility='default' filepath='include/linux/pm_domain.h' line='141' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='lock_flags' type-id='7359adad' visibility='default' filepath='include/linux/pm_domain.h' line='142' column='1'/>
        </data-member>
      </class-decl>
      <qualified-type-def type-id='4c993ea6' const='yes' id='3cc19423'/>
      <pointer-type-def type-id='3cc19423' size-in-bits='64' id='adbc0a2b'/>
      <pointer-type-def type-id='3ba81dd0' size-in-bits='64' id='02e48bc6'/>
      <pointer-type-def type-id='3e115181' size-in-bits='64' id='5db9bd89'/>
      <pointer-type-def type-id='d52c7591' size-in-bits='64' id='855e3679'/>
      <pointer-type-def type-id='d5e6c299' size-in-bits='64' id='ab59ee31'/>
      <pointer-type-def type-id='2aedd95d' size-in-bits='64' id='16052051'/>
      <pointer-type-def type-id='a6676061' size-in-bits='64' id='9ab734dd'/>
      <pointer-type-def type-id='adbacf87' size-in-bits='64' id='791b4a6b'/>
      <pointer-type-def type-id='08aeec0d' size-in-bits='64' id='e62a60bd'/>
      <pointer-type-def type-id='f60505a1' size-in-bits='64' id='cb27da0d'/>
      <pointer-type-def type-id='0393750b' size-in-bits='64' id='df4bf537'/>
      <pointer-type-def type-id='e5a91b7f' size-in-bits='64' id='0adcd7cb'/>
      <pointer-type-def type-id='4f4445b6' size-in-bits='64' id='cccdf8f0'/>
      <pointer-type-def type-id='35210e5c' size-in-bits='64' id='c24523fe'/>
      <pointer-type-def type-id='7ebd7dab' size-in-bits='64' id='795e6e5f'/>
      <pointer-type-def type-id='a017baf8' size-in-bits='64' id='28773d52'/>
      <function-decl name='pm_genpd_add_subdomain' mangled-name='pm_genpd_add_subdomain' filepath='drivers/base/power/domain.c' line='1666' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pm_genpd_add_subdomain'>
        <parameter type-id='855e3679' name='genpd' filepath='drivers/base/power/domain.c' line='1666' column='1'/>
        <parameter type-id='855e3679' name='subdomain' filepath='drivers/base/power/domain.c' line='1667' column='1'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='pm_genpd_init' mangled-name='pm_genpd_init' filepath='drivers/base/power/domain.c' line='1765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pm_genpd_init'>
        <parameter type-id='855e3679' name='genpd' filepath='drivers/base/power/domain.c' line='1765' column='1'/>
        <parameter type-id='5db9bd89' name='gov' filepath='drivers/base/power/domain.c' line='1766' column='1'/>
        <parameter type-id='b50a4934' name='is_off' filepath='drivers/base/power/domain.c' line='1766' column='1'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='of_genpd_add_provider_simple' mangled-name='of_genpd_add_provider_simple' filepath='drivers/base/power/domain.c' line='2028' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='of_genpd_add_provider_simple'>
        <parameter type-id='9a537bbe' name='np' filepath='drivers/base/power/domain.c' line='2028' column='1'/>
        <parameter type-id='855e3679' name='genpd' filepath='drivers/base/power/domain.c' line='2029' column='1'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-type size-in-bits='64' id='2aedd95d'>
        <parameter type-id='855e3679'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='a6676061'>
        <parameter type-id='855e3679'/>
        <parameter type-id='fa0b179b'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='adbacf87'>
        <parameter type-id='855e3679'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='f60505a1'>
        <parameter type-id='a4375c03'/>
        <return type-id='b50a4934'/>
      </function-type>
      <function-type size-in-bits='64' id='0393750b'>
        <parameter type-id='fa0b179b'/>
        <return type-id='b50a4934'/>
      </function-type>
      <function-type size-in-bits='64' id='e5a91b7f'>
        <parameter type-id='855e3679'/>
        <parameter type-id='02e48bc6'/>
        <return type-id='f0981eeb'/>
      </function-type>
      <function-type size-in-bits='64' id='4f4445b6'>
        <parameter type-id='855e3679'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='35210e5c'>
        <parameter type-id='855e3679'/>
        <parameter type-id='fa0b179b'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='7ebd7dab'>
        <parameter type-id='855e3679'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='a017baf8'>
        <parameter type-id='ab59ee31'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/power/runtime.c' language='LANG_C89'>
      <class-decl name='pm_qos_constraints' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/pm_qos.h' line='52' column='1' id='4ad5b81b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='list' type-id='57b0eed2' visibility='default' filepath='include/linux/pm_qos.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='target_value' type-id='a7832498' visibility='default' filepath='include/linux/pm_qos.h' line='54' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='default_value' type-id='a7832498' visibility='default' filepath='include/linux/pm_qos.h' line='55' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='no_constraint_value' type-id='a7832498' visibility='default' filepath='include/linux/pm_qos.h' line='56' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='type' type-id='1389f6b6' visibility='default' filepath='include/linux/pm_qos.h' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='notifiers' type-id='282b7312' visibility='default' filepath='include/linux/pm_qos.h' line='58' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='plist_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/plist.h' line='79' column='1' id='57b0eed2'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='node_list' type-id='72f469ec' visibility='default' filepath='include/linux/plist.h' line='80' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='pm_qos_type' filepath='include/linux/pm_qos.h' line='41' column='1' id='1389f6b6'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='PM_QOS_UNITIALIZED' value='0'/>
        <enumerator name='PM_QOS_MAX' value='1'/>
        <enumerator name='PM_QOS_MIN' value='2'/>
      </enum-decl>
      <class-decl name='freq_constraints' size-in-bits='1536' is-struct='yes' visibility='default' filepath='include/linux/pm_qos.h' line='85' column='1' id='7ca99f8c'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='min_freq' type-id='4ad5b81b' visibility='default' filepath='include/linux/pm_qos.h' line='86' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='min_freq_notifiers' type-id='708c2394' visibility='default' filepath='include/linux/pm_qos.h' line='87' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='max_freq' type-id='4ad5b81b' visibility='default' filepath='include/linux/pm_qos.h' line='88' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='max_freq_notifiers' type-id='708c2394' visibility='default' filepath='include/linux/pm_qos.h' line='89' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pm_qos_flags' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/pm_qos.h' line='71' column='1' id='e0a9bd3c'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='list' type-id='72f469ec' visibility='default' filepath='include/linux/pm_qos.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='effective_flags' type-id='a7832498' visibility='default' filepath='include/linux/pm_qos.h' line='73' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='dev_pm_qos_request' size-in-bits='576' is-struct='yes' visibility='default' filepath='include/linux/pm_qos.h' line='107' column='1' id='32536656'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='type' type-id='c47ba023' visibility='default' filepath='include/linux/pm_qos.h' line='108' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='data' type-id='ac5ab598' visibility='default' filepath='include/linux/pm_qos.h' line='113' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='dev' type-id='fa0b179b' visibility='default' filepath='include/linux/pm_qos.h' line='114' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='dev_pm_qos_req_type' filepath='include/linux/pm_qos.h' line='99' column='1' id='c47ba023'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='DEV_PM_QOS_RESUME_LATENCY' value='1'/>
        <enumerator name='DEV_PM_QOS_LATENCY_TOLERANCE' value='2'/>
        <enumerator name='DEV_PM_QOS_MIN_FREQUENCY' value='3'/>
        <enumerator name='DEV_PM_QOS_MAX_FREQUENCY' value='4'/>
        <enumerator name='DEV_PM_QOS_FLAGS' value='5'/>
      </enum-decl>
      <union-decl name='__anonymous_union__' size-in-bits='448' is-anonymous='yes' visibility='default' filepath='include/linux/pm_qos.h' line='109' column='1' id='ac5ab598'>
        <data-member access='private'>
          <var-decl name='pnode' type-id='e3a91a7c' visibility='default' filepath='include/linux/pm_qos.h' line='110' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='flr' type-id='a70ae6be' visibility='default' filepath='include/linux/pm_qos.h' line='111' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='freq' type-id='da4cc8f3' visibility='default' filepath='include/linux/pm_qos.h' line='112' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='pm_qos_flags_request' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/pm_qos.h' line='66' column='1' id='a70ae6be'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='node' type-id='72f469ec' visibility='default' filepath='include/linux/pm_qos.h' line='67' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='flags' type-id='a7832498' visibility='default' filepath='include/linux/pm_qos.h' line='68' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='freq_qos_request' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/pm_qos.h' line='92' column='1' id='da4cc8f3'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='type' type-id='1df5cca8' visibility='default' filepath='include/linux/pm_qos.h' line='93' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='pnode' type-id='e3a91a7c' visibility='default' filepath='include/linux/pm_qos.h' line='94' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='qos' type-id='1351457a' visibility='default' filepath='include/linux/pm_qos.h' line='95' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='freq_qos_req_type' filepath='include/linux/pm_qos.h' line='80' column='1' id='1df5cca8'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='FREQ_QOS_MIN' value='1'/>
        <enumerator name='FREQ_QOS_MAX' value='2'/>
      </enum-decl>
      <pointer-type-def type-id='32536656' size-in-bits='64' id='a80fd1bc'/>
      <pointer-type-def type-id='7ca99f8c' size-in-bits='64' id='1351457a'/>
      <function-decl name='__pm_runtime_idle' mangled-name='__pm_runtime_idle' filepath='drivers/base/power/runtime.c' line='1001' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__pm_runtime_idle'>
        <parameter type-id='fa0b179b' name='dev' filepath='drivers/base/power/runtime.c' line='1001' column='1'/>
        <parameter type-id='95e97e5e' name='rpmflags' filepath='drivers/base/power/runtime.c' line='1001' column='1'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='__pm_runtime_resume' mangled-name='__pm_runtime_resume' filepath='drivers/base/power/runtime.c' line='1068' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__pm_runtime_resume'>
        <parameter type-id='fa0b179b' name='dev' filepath='drivers/base/power/runtime.c' line='1068' column='1'/>
        <parameter type-id='95e97e5e' name='rpmflags' filepath='drivers/base/power/runtime.c' line='1068' column='1'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='__pm_runtime_set_status' mangled-name='__pm_runtime_set_status' filepath='drivers/base/power/runtime.c' line='1154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__pm_runtime_set_status'>
        <parameter type-id='fa0b179b' name='dev' filepath='drivers/base/power/runtime.c' line='1154' column='1'/>
        <parameter type-id='f0981eeb' name='status' filepath='drivers/base/power/runtime.c' line='1154' column='1'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='__pm_runtime_disable' mangled-name='__pm_runtime_disable' filepath='drivers/base/power/runtime.c' line='1351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__pm_runtime_disable'>
        <parameter type-id='fa0b179b' name='dev' filepath='drivers/base/power/runtime.c' line='1351' column='1'/>
        <parameter type-id='b50a4934' name='check_resume' filepath='drivers/base/power/runtime.c' line='1351' column='1'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/power/wakeup.c' language='LANG_C89'>
      <function-decl name='device_wakeup_enable' mangled-name='device_wakeup_enable' filepath='drivers/base/power/wakeup.c' line='339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='device_wakeup_enable'>
        <parameter type-id='fa0b179b' name='dev' filepath='drivers/base/power/wakeup.c' line='339' column='1'/>
        <return type-id='95e97e5e'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/regmap/regmap-i2c.c' language='LANG_C89'>
      <qualified-type-def type-id='a9cdb48b' const='yes' id='220a92c2'/>
      <pointer-type-def type-id='220a92c2' size-in-bits='64' id='7ea54338'/>
      <function-decl name='i2c_transfer_buffer_flags' mangled-name='i2c_transfer_buffer_flags' filepath='include/linux/i2c.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='i2c_transfer_buffer_flags'>
        <parameter type-id='7ea54338'/>
        <parameter type-id='26a90f95'/>
        <parameter type-id='95e97e5e'/>
        <parameter type-id='8efea9e5'/>
        <return type-id='95e97e5e'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/regmap/regmap-spi.c' language='LANG_C89'>
      <class-decl name='dma_chan' is-struct='yes' visibility='default' is-declaration-only='yes' id='5e3b10aa'/>
      <class-decl name='spi_controller_mem_ops' size-in-bits='512' is-struct='yes' visibility='default' is-declaration-only='yes' id='40c992e3'/>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='1088' id='96b80745'>
        <subrange length='17' type-id='7ff19f0f' id='888ad0ed'/>
      </array-type-def>
      <class-decl name='spi_device' size-in-bits='8896' is-struct='yes' visibility='default' filepath='include/linux/spi/spi.h' line='159' column='1' id='72c0e160'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='dev' type-id='66e487eb' visibility='default' filepath='include/linux/spi/spi.h' line='160' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6144'>
          <var-decl name='controller' type-id='f22e4524' visibility='default' filepath='include/linux/spi/spi.h' line='161' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6208'>
          <var-decl name='master' type-id='f22e4524' visibility='default' filepath='include/linux/spi/spi.h' line='162' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6272'>
          <var-decl name='max_speed_hz' type-id='19c2251e' visibility='default' filepath='include/linux/spi/spi.h' line='163' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6304'>
          <var-decl name='chip_select' type-id='f9b06939' visibility='default' filepath='include/linux/spi/spi.h' line='164' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6312'>
          <var-decl name='bits_per_word' type-id='f9b06939' visibility='default' filepath='include/linux/spi/spi.h' line='165' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6320'>
          <var-decl name='rt' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='166' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6336'>
          <var-decl name='mode' type-id='19c2251e' visibility='default' filepath='include/linux/spi/spi.h' line='167' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6368'>
          <var-decl name='irq' type-id='95e97e5e' visibility='default' filepath='include/linux/spi/spi.h' line='188' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6400'>
          <var-decl name='controller_state' type-id='eaa32e2f' visibility='default' filepath='include/linux/spi/spi.h' line='189' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6464'>
          <var-decl name='controller_data' type-id='eaa32e2f' visibility='default' filepath='include/linux/spi/spi.h' line='190' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6528'>
          <var-decl name='modalias' type-id='16dc656a' visibility='default' filepath='include/linux/spi/spi.h' line='191' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6784'>
          <var-decl name='driver_override' type-id='80f4b756' visibility='default' filepath='include/linux/spi/spi.h' line='192' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6848'>
          <var-decl name='cs_gpio' type-id='95e97e5e' visibility='default' filepath='include/linux/spi/spi.h' line='193' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6912'>
          <var-decl name='cs_gpiod' type-id='26760480' visibility='default' filepath='include/linux/spi/spi.h' line='194' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6976'>
          <var-decl name='word_delay' type-id='5a467bb1' visibility='default' filepath='include/linux/spi/spi.h' line='195' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7040'>
          <var-decl name='statistics' type-id='bf41d149' visibility='default' filepath='include/linux/spi/spi.h' line='198' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='spi_controller' size-in-bits='12032' is-struct='yes' visibility='default' filepath='include/linux/spi/spi.h' line='466' column='1' id='db1b9d9e'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='dev' type-id='66e487eb' visibility='default' filepath='include/linux/spi/spi.h' line='467' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6144'>
          <var-decl name='list' type-id='72f469ec' visibility='default' filepath='include/linux/spi/spi.h' line='469' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6272'>
          <var-decl name='bus_num' type-id='9b7e9486' visibility='default' filepath='include/linux/spi/spi.h' line='477' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6288'>
          <var-decl name='num_chipselect' type-id='1dc6a898' visibility='default' filepath='include/linux/spi/spi.h' line='482' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6304'>
          <var-decl name='dma_alignment' type-id='1dc6a898' visibility='default' filepath='include/linux/spi/spi.h' line='487' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6336'>
          <var-decl name='mode_bits' type-id='19c2251e' visibility='default' filepath='include/linux/spi/spi.h' line='490' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6368'>
          <var-decl name='buswidth_override_bits' type-id='19c2251e' visibility='default' filepath='include/linux/spi/spi.h' line='493' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6400'>
          <var-decl name='bits_per_word_mask' type-id='19c2251e' visibility='default' filepath='include/linux/spi/spi.h' line='496' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6432'>
          <var-decl name='min_speed_hz' type-id='19c2251e' visibility='default' filepath='include/linux/spi/spi.h' line='501' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6464'>
          <var-decl name='max_speed_hz' type-id='19c2251e' visibility='default' filepath='include/linux/spi/spi.h' line='502' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6496'>
          <var-decl name='flags' type-id='1dc6a898' visibility='default' filepath='include/linux/spi/spi.h' line='505' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6512'>
          <var-decl name='slave' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='515' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6528'>
          <var-decl name='max_transfer_size' type-id='fc096b90' visibility='default' filepath='include/linux/spi/spi.h' line='521' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6592'>
          <var-decl name='max_message_size' type-id='fc096b90' visibility='default' filepath='include/linux/spi/spi.h' line='522' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6656'>
          <var-decl name='io_mutex' type-id='925167dc' visibility='default' filepath='include/linux/spi/spi.h' line='525' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6912'>
          <var-decl name='bus_lock_spinlock' type-id='fb4018a0' visibility='default' filepath='include/linux/spi/spi.h' line='528' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6976'>
          <var-decl name='bus_lock_mutex' type-id='925167dc' visibility='default' filepath='include/linux/spi/spi.h' line='529' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7232'>
          <var-decl name='bus_lock_flag' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='532' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7296'>
          <var-decl name='setup' type-id='4f312040' visibility='default' filepath='include/linux/spi/spi.h' line='540' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7360'>
          <var-decl name='set_cs_timing' type-id='5a7d3cfc' visibility='default' filepath='include/linux/spi/spi.h' line='550' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7424'>
          <var-decl name='transfer' type-id='08bd785c' visibility='default' filepath='include/linux/spi/spi.h' line='572' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7488'>
          <var-decl name='cleanup' type-id='c965bc43' visibility='default' filepath='include/linux/spi/spi.h' line='576' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7552'>
          <var-decl name='can_dma' type-id='b7f92ac9' visibility='default' filepath='include/linux/spi/spi.h' line='585' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7616'>
          <var-decl name='queued' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='595' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7680'>
          <var-decl name='kworker' type-id='c41f4539' visibility='default' filepath='include/linux/spi/spi.h' line='596' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7744'>
          <var-decl name='pump_messages' type-id='ac165296' visibility='default' filepath='include/linux/spi/spi.h' line='597' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8064'>
          <var-decl name='queue_lock' type-id='fb4018a0' visibility='default' filepath='include/linux/spi/spi.h' line='598' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8128'>
          <var-decl name='queue' type-id='72f469ec' visibility='default' filepath='include/linux/spi/spi.h' line='599' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8256'>
          <var-decl name='cur_msg' type-id='bb7889ed' visibility='default' filepath='include/linux/spi/spi.h' line='600' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8320'>
          <var-decl name='idling' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='601' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8328'>
          <var-decl name='busy' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='602' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8336'>
          <var-decl name='running' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='603' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8344'>
          <var-decl name='rt' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='604' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8352'>
          <var-decl name='auto_runtime_pm' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='605' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8360'>
          <var-decl name='cur_msg_prepared' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='606' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8368'>
          <var-decl name='cur_msg_mapped' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='607' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8376'>
          <var-decl name='last_cs_enable' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='608' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8384'>
          <var-decl name='last_cs_mode_high' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='609' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8392'>
          <var-decl name='fallback' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='610' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8448'>
          <var-decl name='xfer_completion' type-id='f9fef04f' visibility='default' filepath='include/linux/spi/spi.h' line='611' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8704'>
          <var-decl name='max_dma_len' type-id='b59d7dce' visibility='default' filepath='include/linux/spi/spi.h' line='612' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8768'>
          <var-decl name='prepare_transfer_hardware' type-id='3de177aa' visibility='default' filepath='include/linux/spi/spi.h' line='614' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8832'>
          <var-decl name='transfer_one_message' type-id='424a6df6' visibility='default' filepath='include/linux/spi/spi.h' line='615' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8896'>
          <var-decl name='unprepare_transfer_hardware' type-id='3de177aa' visibility='default' filepath='include/linux/spi/spi.h' line='617' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8960'>
          <var-decl name='prepare_message' type-id='424a6df6' visibility='default' filepath='include/linux/spi/spi.h' line='618' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9024'>
          <var-decl name='unprepare_message' type-id='424a6df6' visibility='default' filepath='include/linux/spi/spi.h' line='620' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9088'>
          <var-decl name='slave_abort' type-id='3de177aa' visibility='default' filepath='include/linux/spi/spi.h' line='622' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9152'>
          <var-decl name='set_cs' type-id='54a1bec6' visibility='default' filepath='include/linux/spi/spi.h' line='628' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9216'>
          <var-decl name='transfer_one' type-id='6495fd5b' visibility='default' filepath='include/linux/spi/spi.h' line='629' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9280'>
          <var-decl name='handle_err' type-id='72fa5619' visibility='default' filepath='include/linux/spi/spi.h' line='631' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9344'>
          <var-decl name='mem_ops' type-id='e93ac78c' visibility='default' filepath='include/linux/spi/spi.h' line='635' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9408'>
          <var-decl name='cs_setup' type-id='5a467bb1' visibility='default' filepath='include/linux/spi/spi.h' line='638' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9440'>
          <var-decl name='cs_hold' type-id='5a467bb1' visibility='default' filepath='include/linux/spi/spi.h' line='639' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9472'>
          <var-decl name='cs_inactive' type-id='5a467bb1' visibility='default' filepath='include/linux/spi/spi.h' line='640' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9536'>
          <var-decl name='cs_gpios' type-id='7292109c' visibility='default' filepath='include/linux/spi/spi.h' line='643' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9600'>
          <var-decl name='cs_gpiods' type-id='35c9579e' visibility='default' filepath='include/linux/spi/spi.h' line='644' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9664'>
          <var-decl name='use_gpio_descriptors' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='645' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9672'>
          <var-decl name='unused_native_cs' type-id='f9b06939' visibility='default' filepath='include/linux/spi/spi.h' line='646' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9680'>
          <var-decl name='max_native_cs' type-id='f9b06939' visibility='default' filepath='include/linux/spi/spi.h' line='647' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9728'>
          <var-decl name='statistics' type-id='bf41d149' visibility='default' filepath='include/linux/spi/spi.h' line='650' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11584'>
          <var-decl name='dma_tx' type-id='27f3f5d8' visibility='default' filepath='include/linux/spi/spi.h' line='653' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11648'>
          <var-decl name='dma_rx' type-id='27f3f5d8' visibility='default' filepath='include/linux/spi/spi.h' line='654' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11712'>
          <var-decl name='dummy_rx' type-id='eaa32e2f' visibility='default' filepath='include/linux/spi/spi.h' line='657' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11776'>
          <var-decl name='dummy_tx' type-id='eaa32e2f' visibility='default' filepath='include/linux/spi/spi.h' line='658' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11840'>
          <var-decl name='fw_translate_cs' type-id='aaa6c630' visibility='default' filepath='include/linux/spi/spi.h' line='660' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11904'>
          <var-decl name='ptp_sts_supported' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='666' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11968'>
          <var-decl name='irq_flags' type-id='7359adad' visibility='default' filepath='include/linux/spi/spi.h' line='669' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='spi_delay' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/linux/spi/spi.h' line='98' column='1' id='5a467bb1'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='value' type-id='1dc6a898' visibility='default' filepath='include/linux/spi/spi.h' line='102' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='unit' type-id='f9b06939' visibility='default' filepath='include/linux/spi/spi.h' line='103' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='spi_transfer' size-in-bits='1152' is-struct='yes' visibility='default' filepath='include/linux/spi/spi.h' line='907' column='1' id='9b7f1a95'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='tx_buf' type-id='eaa32e2f' visibility='default' filepath='include/linux/spi/spi.h' line='913' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='rx_buf' type-id='eaa32e2f' visibility='default' filepath='include/linux/spi/spi.h' line='914' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='len' type-id='f0981eeb' visibility='default' filepath='include/linux/spi/spi.h' line='915' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='tx_dma' type-id='cf29c9b3' visibility='default' filepath='include/linux/spi/spi.h' line='917' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='rx_dma' type-id='cf29c9b3' visibility='default' filepath='include/linux/spi/spi.h' line='918' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='tx_sg' type-id='c59e4f4c' visibility='default' filepath='include/linux/spi/spi.h' line='919' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='rx_sg' type-id='c59e4f4c' visibility='default' filepath='include/linux/spi/spi.h' line='920' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31'>
          <var-decl name='cs_change' type-id='f0981eeb' visibility='default' filepath='include/linux/spi/spi.h' line='922' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='28'>
          <var-decl name='tx_nbits' type-id='f0981eeb' visibility='default' filepath='include/linux/spi/spi.h' line='923' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='25'>
          <var-decl name='rx_nbits' type-id='f0981eeb' visibility='default' filepath='include/linux/spi/spi.h' line='924' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='584'>
          <var-decl name='bits_per_word' type-id='f9b06939' visibility='default' filepath='include/linux/spi/spi.h' line='928' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='592'>
          <var-decl name='delay_usecs' type-id='1dc6a898' visibility='default' filepath='include/linux/spi/spi.h' line='929' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='608'>
          <var-decl name='delay' type-id='5a467bb1' visibility='default' filepath='include/linux/spi/spi.h' line='930' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='cs_change_delay' type-id='5a467bb1' visibility='default' filepath='include/linux/spi/spi.h' line='931' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='672'>
          <var-decl name='word_delay' type-id='5a467bb1' visibility='default' filepath='include/linux/spi/spi.h' line='932' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='speed_hz' type-id='19c2251e' visibility='default' filepath='include/linux/spi/spi.h' line='933' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='736'>
          <var-decl name='effective_speed_hz' type-id='19c2251e' visibility='default' filepath='include/linux/spi/spi.h' line='935' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='ptp_sts_word_pre' type-id='f0981eeb' visibility='default' filepath='include/linux/spi/spi.h' line='937' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='800'>
          <var-decl name='ptp_sts_word_post' type-id='f0981eeb' visibility='default' filepath='include/linux/spi/spi.h' line='938' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='ptp_sts' type-id='89a8217c' visibility='default' filepath='include/linux/spi/spi.h' line='940' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='timestamped' type-id='b50a4934' visibility='default' filepath='include/linux/spi/spi.h' line='942' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='transfer_list' type-id='72f469ec' visibility='default' filepath='include/linux/spi/spi.h' line='944' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='error' type-id='1dc6a898' visibility='default' filepath='include/linux/spi/spi.h' line='947' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='ptp_system_timestamp' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/ptp_clock_kernel.h' line='33' column='1' id='bf77b476'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='pre_ts' type-id='40a816ad' visibility='default' filepath='include/linux/ptp_clock_kernel.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='post_ts' type-id='40a816ad' visibility='default' filepath='include/linux/ptp_clock_kernel.h' line='35' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kthread_worker' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/kthread.h' line='89' column='1' id='62968721'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='flags' type-id='f0981eeb' visibility='default' filepath='include/linux/kthread.h' line='90' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='lock' type-id='f5c90b3f' visibility='default' filepath='include/linux/kthread.h' line='91' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='work_list' type-id='72f469ec' visibility='default' filepath='include/linux/kthread.h' line='92' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='delayed_work_list' type-id='72f469ec' visibility='default' filepath='include/linux/kthread.h' line='93' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='task' type-id='f23e2572' visibility='default' filepath='include/linux/kthread.h' line='94' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='current_work' type-id='401eb95c' visibility='default' filepath='include/linux/kthread.h' line='95' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kthread_work' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/kthread.h' line='98' column='1' id='ac165296'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='node' type-id='72f469ec' visibility='default' filepath='include/linux/kthread.h' line='99' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='func' type-id='a785c7fd' visibility='default' filepath='include/linux/kthread.h' line='100' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='worker' type-id='c41f4539' visibility='default' filepath='include/linux/kthread.h' line='101' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='canceling' type-id='95e97e5e' visibility='default' filepath='include/linux/kthread.h' line='103' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='kthread_work_func_t' type-id='2a5d0ea1' filepath='include/linux/kthread.h' line='82' column='1' id='a785c7fd'/>
      <class-decl name='spi_message' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/linux/spi/spi.h' line='980' column='1' id='4dd90c3d'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='transfers' type-id='72f469ec' visibility='default' filepath='include/linux/spi/spi.h' line='981' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='spi' type-id='e90f4666' visibility='default' filepath='include/linux/spi/spi.h' line='983' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31'>
          <var-decl name='is_dma_mapped' type-id='f0981eeb' visibility='default' filepath='include/linux/spi/spi.h' line='985' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='complete' type-id='b7f9d8e6' visibility='default' filepath='include/linux/spi/spi.h' line='999' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='context' type-id='eaa32e2f' visibility='default' filepath='include/linux/spi/spi.h' line='1000' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='frame_length' type-id='f0981eeb' visibility='default' filepath='include/linux/spi/spi.h' line='1001' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='416'>
          <var-decl name='actual_length' type-id='f0981eeb' visibility='default' filepath='include/linux/spi/spi.h' line='1002' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='status' type-id='95e97e5e' visibility='default' filepath='include/linux/spi/spi.h' line='1003' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='queue' type-id='72f469ec' visibility='default' filepath='include/linux/spi/spi.h' line='1009' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='state' type-id='eaa32e2f' visibility='default' filepath='include/linux/spi/spi.h' line='1010' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='resources' type-id='72f469ec' visibility='default' filepath='include/linux/spi/spi.h' line='1013' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='spi_statistics' size-in-bits='1856' is-struct='yes' visibility='default' filepath='include/linux/spi/spi.h' line='56' column='1' id='bf41d149'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='include/linux/spi/spi.h' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='messages' type-id='7359adad' visibility='default' filepath='include/linux/spi/spi.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='transfers' type-id='7359adad' visibility='default' filepath='include/linux/spi/spi.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='errors' type-id='7359adad' visibility='default' filepath='include/linux/spi/spi.h' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='timedout' type-id='7359adad' visibility='default' filepath='include/linux/spi/spi.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='spi_sync' type-id='7359adad' visibility='default' filepath='include/linux/spi/spi.h' line='64' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='spi_sync_immediate' type-id='7359adad' visibility='default' filepath='include/linux/spi/spi.h' line='65' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='spi_async' type-id='7359adad' visibility='default' filepath='include/linux/spi/spi.h' line='66' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='bytes' type-id='3a47d82b' visibility='default' filepath='include/linux/spi/spi.h' line='68' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='bytes_rx' type-id='3a47d82b' visibility='default' filepath='include/linux/spi/spi.h' line='69' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='bytes_tx' type-id='3a47d82b' visibility='default' filepath='include/linux/spi/spi.h' line='70' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='transfer_bytes_histo' type-id='96b80745' visibility='default' filepath='include/linux/spi/spi.h' line='73' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='transfers_split_maxsize' type-id='7359adad' visibility='default' filepath='include/linux/spi/spi.h' line='75' column='1'/>
        </data-member>
      </class-decl>
      <qualified-type-def type-id='40c992e3' const='yes' id='68e801ee'/>
      <pointer-type-def type-id='68e801ee' size-in-bits='64' id='e93ac78c'/>
      <pointer-type-def type-id='5e3b10aa' size-in-bits='64' id='27f3f5d8'/>
      <pointer-type-def type-id='26760480' size-in-bits='64' id='35c9579e'/>
      <pointer-type-def type-id='d96066b0' size-in-bits='64' id='3de177aa'/>
      <pointer-type-def type-id='006d72ff' size-in-bits='64' id='6495fd5b'/>
      <pointer-type-def type-id='4afdce44' size-in-bits='64' id='424a6df6'/>
      <pointer-type-def type-id='01e1f26e' size-in-bits='64' id='aaa6c630'/>
      <pointer-type-def type-id='fb73ecde' size-in-bits='64' id='4f312040'/>
      <pointer-type-def type-id='68aac70a' size-in-bits='64' id='5a7d3cfc'/>
      <pointer-type-def type-id='d06fe862' size-in-bits='64' id='08bd785c'/>
      <pointer-type-def type-id='ac165296' size-in-bits='64' id='401eb95c'/>
      <pointer-type-def type-id='62968721' size-in-bits='64' id='c41f4539'/>
      <pointer-type-def type-id='bf77b476' size-in-bits='64' id='89a8217c'/>
      <pointer-type-def type-id='db1b9d9e' size-in-bits='64' id='f22e4524'/>
      <pointer-type-def type-id='5a467bb1' size-in-bits='64' id='652fafc9'/>
      <pointer-type-def type-id='72c0e160' size-in-bits='64' id='e90f4666'/>
      <pointer-type-def type-id='4dd90c3d' size-in-bits='64' id='bb7889ed'/>
      <pointer-type-def type-id='9b7f1a95' size-in-bits='64' id='7c11f655'/>
      <pointer-type-def type-id='579042ad' size-in-bits='64' id='b7f92ac9'/>
      <pointer-type-def type-id='50f7c736' size-in-bits='64' id='fc096b90'/>
      <pointer-type-def type-id='38d1cb6d' size-in-bits='64' id='2a5d0ea1'/>
      <pointer-type-def type-id='0c71d025' size-in-bits='64' id='72fa5619'/>
      <pointer-type-def type-id='3243417f' size-in-bits='64' id='c965bc43'/>
      <pointer-type-def type-id='9ea75344' size-in-bits='64' id='54a1bec6'/>
      <function-decl name='spi_sync' mangled-name='spi_sync' filepath='include/linux/spi/spi.h' line='1217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spi_sync'>
        <parameter type-id='e90f4666'/>
        <parameter type-id='bb7889ed'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-type size-in-bits='64' id='d96066b0'>
        <parameter type-id='f22e4524'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='006d72ff'>
        <parameter type-id='f22e4524'/>
        <parameter type-id='e90f4666'/>
        <parameter type-id='7c11f655'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='4afdce44'>
        <parameter type-id='f22e4524'/>
        <parameter type-id='bb7889ed'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='01e1f26e'>
        <parameter type-id='f22e4524'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='fb73ecde'>
        <parameter type-id='e90f4666'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='68aac70a'>
        <parameter type-id='e90f4666'/>
        <parameter type-id='652fafc9'/>
        <parameter type-id='652fafc9'/>
        <parameter type-id='652fafc9'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='d06fe862'>
        <parameter type-id='e90f4666'/>
        <parameter type-id='bb7889ed'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='579042ad'>
        <parameter type-id='f22e4524'/>
        <parameter type-id='e90f4666'/>
        <parameter type-id='7c11f655'/>
        <return type-id='b50a4934'/>
      </function-type>
      <function-type size-in-bits='64' id='50f7c736'>
        <parameter type-id='e90f4666'/>
        <return type-id='b59d7dce'/>
      </function-type>
      <function-type size-in-bits='64' id='38d1cb6d'>
        <parameter type-id='401eb95c'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='0c71d025'>
        <parameter type-id='f22e4524'/>
        <parameter type-id='bb7889ed'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='3243417f'>
        <parameter type-id='e90f4666'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='9ea75344'>
        <parameter type-id='e90f4666'/>
        <parameter type-id='b50a4934'/>
        <return type-id='48b5725f'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/regmap/regmap.c' language='LANG_C89'>
      <class-decl name='hwspinlock' is-struct='yes' visibility='default' is-declaration-only='yes' id='38db93a7'/>
      <typedef-decl name='regmap_lock' type-id='b7f9d8e6' filepath='include/linux/regmap.h' line='226' column='1' id='a4d5c862'/>
      <typedef-decl name='regmap_unlock' type-id='b7f9d8e6' filepath='include/linux/regmap.h' line='227' column='1' id='cf202c75'/>
      <class-decl name='regmap_format' size-in-bits='576' is-struct='yes' visibility='default' filepath='drivers/base/regmap/internal.h' line='30' column='1' id='32ee7e31'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='buf_size' type-id='b59d7dce' visibility='default' filepath='drivers/base/regmap/internal.h' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='reg_bytes' type-id='b59d7dce' visibility='default' filepath='drivers/base/regmap/internal.h' line='32' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='pad_bytes' type-id='b59d7dce' visibility='default' filepath='drivers/base/regmap/internal.h' line='33' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='val_bytes' type-id='b59d7dce' visibility='default' filepath='drivers/base/regmap/internal.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='format_write' type-id='d1abd66c' visibility='default' filepath='drivers/base/regmap/internal.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='format_reg' type-id='8052541e' visibility='default' filepath='drivers/base/regmap/internal.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='format_val' type-id='8052541e' visibility='default' filepath='drivers/base/regmap/internal.h' line='38' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='parse_val' type-id='caa804f2' visibility='default' filepath='drivers/base/regmap/internal.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='parse_inplace' type-id='b7f9d8e6' visibility='default' filepath='drivers/base/regmap/internal.h' line='40' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='regmap_bus' size-in-bits='896' is-struct='yes' visibility='default' filepath='include/linux/regmap.h' line='498' column='1' id='bd5f6464'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='fast_io' type-id='b50a4934' visibility='default' filepath='include/linux/regmap.h' line='499' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='write' type-id='928c5b64' visibility='default' filepath='include/linux/regmap.h' line='500' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='gather_write' type-id='60be0faa' visibility='default' filepath='include/linux/regmap.h' line='501' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='async_write' type-id='6ee2c7d7' visibility='default' filepath='include/linux/regmap.h' line='502' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='reg_write' type-id='8c8780d1' visibility='default' filepath='include/linux/regmap.h' line='503' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='reg_update_bits' type-id='59483ee8' visibility='default' filepath='include/linux/regmap.h' line='504' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='read' type-id='697414cd' visibility='default' filepath='include/linux/regmap.h' line='505' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='reg_read' type-id='ec8d430e' visibility='default' filepath='include/linux/regmap.h' line='506' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='free_context' type-id='5c459137' visibility='default' filepath='include/linux/regmap.h' line='507' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='async_alloc' type-id='27a024fd' visibility='default' filepath='include/linux/regmap.h' line='508' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='read_flag_mask' type-id='f9b06939' visibility='default' filepath='include/linux/regmap.h' line='509' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='672'>
          <var-decl name='reg_format_endian_default' type-id='e8a9ba7e' visibility='default' filepath='include/linux/regmap.h' line='510' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='val_format_endian_default' type-id='e8a9ba7e' visibility='default' filepath='include/linux/regmap.h' line='511' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='max_raw_read' type-id='b59d7dce' visibility='default' filepath='include/linux/regmap.h' line='512' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='max_raw_write' type-id='b59d7dce' visibility='default' filepath='include/linux/regmap.h' line='513' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='regmap_hw_write' type-id='02a757da' filepath='include/linux/regmap.h' line='442' column='1' id='928c5b64'/>
      <typedef-decl name='regmap_hw_gather_write' type-id='acda35bb' filepath='include/linux/regmap.h' line='444' column='1' id='60be0faa'/>
      <typedef-decl name='regmap_hw_async_write' type-id='38921430' filepath='include/linux/regmap.h' line='447' column='1' id='6ee2c7d7'/>
      <class-decl name='regmap_async' size-in-bits='256' is-struct='yes' visibility='default' filepath='drivers/base/regmap/internal.h' line='43' column='1' id='26527266'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='list' type-id='72f469ec' visibility='default' filepath='drivers/base/regmap/internal.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='map' type-id='29af9a71' visibility='default' filepath='drivers/base/regmap/internal.h' line='45' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='work_buf' type-id='eaa32e2f' visibility='default' filepath='drivers/base/regmap/internal.h' line='46' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='regmap_hw_reg_write' type-id='db7eb22d' filepath='include/linux/regmap.h' line='456' column='1' id='8c8780d1'/>
      <typedef-decl name='regmap_hw_reg_update_bits' type-id='3a0b4ecf' filepath='include/linux/regmap.h' line='458' column='1' id='59483ee8'/>
      <typedef-decl name='regmap_hw_read' type-id='acda35bb' filepath='include/linux/regmap.h' line='451' column='1' id='697414cd'/>
      <typedef-decl name='regmap_hw_reg_read' type-id='4893ffdf' filepath='include/linux/regmap.h' line='454' column='1' id='ec8d430e'/>
      <typedef-decl name='regmap_hw_free_context' type-id='b7f9d8e6' filepath='include/linux/regmap.h' line='461' column='1' id='5c459137'/>
      <typedef-decl name='regmap_hw_async_alloc' type-id='68f92bd7' filepath='include/linux/regmap.h' line='460' column='1' id='27a024fd'/>
      <enum-decl name='regmap_endian' filepath='include/linux/regmap.h' line='184' column='1' id='e8a9ba7e'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='REGMAP_ENDIAN_DEFAULT' value='0'/>
        <enumerator name='REGMAP_ENDIAN_BIG' value='1'/>
        <enumerator name='REGMAP_ENDIAN_LITTLE' value='2'/>
        <enumerator name='REGMAP_ENDIAN_NATIVE' value='3'/>
      </enum-decl>
      <class-decl name='regmap_access_table' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/regmap.h' line='219' column='1' id='2bed066b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='yes_ranges' type-id='01dc1e38' visibility='default' filepath='include/linux/regmap.h' line='220' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='n_yes_ranges' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='221' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='no_ranges' type-id='01dc1e38' visibility='default' filepath='include/linux/regmap.h' line='222' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='n_no_ranges' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='223' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='regmap_range' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/regmap.h' line='199' column='1' id='20f6935f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='range_min' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='200' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='range_max' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='201' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='regcache_ops' size-in-bits='576' is-struct='yes' visibility='default' filepath='drivers/base/regmap/internal.h' line='166' column='1' id='81cd3626'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='drivers/base/regmap/internal.h' line='167' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='type' type-id='6e1356fd' visibility='default' filepath='drivers/base/regmap/internal.h' line='168' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='init' type-id='02c2e3f3' visibility='default' filepath='drivers/base/regmap/internal.h' line='169' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='exit' type-id='02c2e3f3' visibility='default' filepath='drivers/base/regmap/internal.h' line='170' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='debugfs_init' type-id='078f0514' visibility='default' filepath='drivers/base/regmap/internal.h' line='172' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='read' type-id='b8529195' visibility='default' filepath='drivers/base/regmap/internal.h' line='174' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='write' type-id='2f739ebb' visibility='default' filepath='drivers/base/regmap/internal.h' line='175' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='sync' type-id='2f739ebb' visibility='default' filepath='drivers/base/regmap/internal.h' line='176' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='drop' type-id='2f739ebb' visibility='default' filepath='drivers/base/regmap/internal.h' line='177' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='regcache_type' filepath='include/linux/regmap.h' line='40' column='1' id='6e1356fd'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='REGCACHE_NONE' value='0'/>
        <enumerator name='REGCACHE_RBTREE' value='1'/>
        <enumerator name='REGCACHE_COMPRESSED' value='2'/>
        <enumerator name='REGCACHE_FLAT' value='3'/>
      </enum-decl>
      <class-decl name='reg_default' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/regmap.h' line='56' column='1' id='0ee576bb'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='reg' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='def' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='58' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='reg_sequence' size-in-bits='96' is-struct='yes' visibility='default' filepath='include/linux/regmap.h' line='71' column='1' id='4fcc4597'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='reg' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='def' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='73' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='delay_us' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='74' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='regmap_config' size-in-bits='2112' is-struct='yes' visibility='default' filepath='include/linux/regmap.h' line='346' column='1' id='20b6fd7c'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/regmap.h' line='347' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='reg_bits' type-id='95e97e5e' visibility='default' filepath='include/linux/regmap.h' line='349' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='reg_stride' type-id='95e97e5e' visibility='default' filepath='include/linux/regmap.h' line='350' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='pad_bits' type-id='95e97e5e' visibility='default' filepath='include/linux/regmap.h' line='351' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='val_bits' type-id='95e97e5e' visibility='default' filepath='include/linux/regmap.h' line='352' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='writeable_reg' type-id='8e565e6d' visibility='default' filepath='include/linux/regmap.h' line='354' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='readable_reg' type-id='8e565e6d' visibility='default' filepath='include/linux/regmap.h' line='355' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='volatile_reg' type-id='8e565e6d' visibility='default' filepath='include/linux/regmap.h' line='356' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='precious_reg' type-id='8e565e6d' visibility='default' filepath='include/linux/regmap.h' line='357' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='writeable_noinc_reg' type-id='8e565e6d' visibility='default' filepath='include/linux/regmap.h' line='358' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='readable_noinc_reg' type-id='8e565e6d' visibility='default' filepath='include/linux/regmap.h' line='359' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='disable_locking' type-id='b50a4934' visibility='default' filepath='include/linux/regmap.h' line='361' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='lock' type-id='a4d5c862' visibility='default' filepath='include/linux/regmap.h' line='362' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='unlock' type-id='cf202c75' visibility='default' filepath='include/linux/regmap.h' line='363' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='lock_arg' type-id='eaa32e2f' visibility='default' filepath='include/linux/regmap.h' line='364' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='reg_read' type-id='4893ffdf' visibility='default' filepath='include/linux/regmap.h' line='366' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='reg_write' type-id='db7eb22d' visibility='default' filepath='include/linux/regmap.h' line='367' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='fast_io' type-id='b50a4934' visibility='default' filepath='include/linux/regmap.h' line='369' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='992'>
          <var-decl name='max_register' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='371' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='wr_table' type-id='76a7b3fe' visibility='default' filepath='include/linux/regmap.h' line='372' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='rd_table' type-id='76a7b3fe' visibility='default' filepath='include/linux/regmap.h' line='373' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='volatile_table' type-id='76a7b3fe' visibility='default' filepath='include/linux/regmap.h' line='374' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='precious_table' type-id='76a7b3fe' visibility='default' filepath='include/linux/regmap.h' line='375' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='wr_noinc_table' type-id='76a7b3fe' visibility='default' filepath='include/linux/regmap.h' line='376' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='rd_noinc_table' type-id='76a7b3fe' visibility='default' filepath='include/linux/regmap.h' line='377' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='reg_defaults' type-id='4825f6ba' visibility='default' filepath='include/linux/regmap.h' line='378' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='num_reg_defaults' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='379' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1504'>
          <var-decl name='cache_type' type-id='6e1356fd' visibility='default' filepath='include/linux/regmap.h' line='380' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='reg_defaults_raw' type-id='eaa32e2f' visibility='default' filepath='include/linux/regmap.h' line='381' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='num_reg_defaults_raw' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='382' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='read_flag_mask' type-id='7359adad' visibility='default' filepath='include/linux/regmap.h' line='384' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='write_flag_mask' type-id='7359adad' visibility='default' filepath='include/linux/regmap.h' line='385' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='zero_flag_mask' type-id='b50a4934' visibility='default' filepath='include/linux/regmap.h' line='386' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1800'>
          <var-decl name='use_single_read' type-id='b50a4934' visibility='default' filepath='include/linux/regmap.h' line='388' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1808'>
          <var-decl name='use_single_write' type-id='b50a4934' visibility='default' filepath='include/linux/regmap.h' line='389' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1816'>
          <var-decl name='can_multi_write' type-id='b50a4934' visibility='default' filepath='include/linux/regmap.h' line='390' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1824'>
          <var-decl name='reg_format_endian' type-id='e8a9ba7e' visibility='default' filepath='include/linux/regmap.h' line='392' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='val_format_endian' type-id='e8a9ba7e' visibility='default' filepath='include/linux/regmap.h' line='393' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='ranges' type-id='cf08cac3' visibility='default' filepath='include/linux/regmap.h' line='395' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='num_ranges' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='396' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2016'>
          <var-decl name='use_hwlock' type-id='b50a4934' visibility='default' filepath='include/linux/regmap.h' line='398' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='hwlock_id' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='399' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2080'>
          <var-decl name='hwlock_mode' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='400' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='regmap_range_cfg' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/regmap.h' line='423' column='1' id='b683d7fe'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/regmap.h' line='424' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='range_min' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='427' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='range_max' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='428' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='selector_reg' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='431' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='selector_mask' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='432' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='selector_shift' type-id='95e97e5e' visibility='default' filepath='include/linux/regmap.h' line='433' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='window_start' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='436' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='window_len' type-id='f0981eeb' visibility='default' filepath='include/linux/regmap.h' line='437' column='1'/>
        </data-member>
      </class-decl>
      <qualified-type-def type-id='0ee576bb' const='yes' id='9fddcab4'/>
      <pointer-type-def type-id='9fddcab4' size-in-bits='64' id='4825f6ba'/>
      <qualified-type-def type-id='81cd3626' const='yes' id='2dd1eb6f'/>
      <pointer-type-def type-id='2dd1eb6f' size-in-bits='64' id='66755d9f'/>
      <qualified-type-def type-id='2bed066b' const='yes' id='a82172e0'/>
      <pointer-type-def type-id='a82172e0' size-in-bits='64' id='76a7b3fe'/>
      <qualified-type-def type-id='bd5f6464' const='yes' id='4dbb5689'/>
      <pointer-type-def type-id='4dbb5689' size-in-bits='64' id='00e96299'/>
      <qualified-type-def type-id='20b6fd7c' const='yes' id='23e41d37'/>
      <pointer-type-def type-id='23e41d37' size-in-bits='64' id='9d19d4a7'/>
      <qualified-type-def type-id='20f6935f' const='yes' id='9a6d2bc2'/>
      <pointer-type-def type-id='9a6d2bc2' size-in-bits='64' id='01dc1e38'/>
      <qualified-type-def type-id='b683d7fe' const='yes' id='9e02903b'/>
      <pointer-type-def type-id='9e02903b' size-in-bits='64' id='cf08cac3'/>
      <pointer-type-def type-id='38db93a7' size-in-bits='64' id='0cb0b26f'/>
      <pointer-type-def type-id='b5732d6f' size-in-bits='64' id='02c2e3f3'/>
      <pointer-type-def type-id='3b43e527' size-in-bits='64' id='2f739ebb'/>
      <pointer-type-def type-id='71e3f969' size-in-bits='64' id='b8529195'/>
      <pointer-type-def type-id='7ee67639' size-in-bits='64' id='db7eb22d'/>
      <pointer-type-def type-id='b4c4ed0b' size-in-bits='64' id='4893ffdf'/>
      <pointer-type-def type-id='9f19269b' size-in-bits='64' id='3a0b4ecf'/>
      <pointer-type-def type-id='bc6e6178' size-in-bits='64' id='02a757da'/>
      <pointer-type-def type-id='51192447' size-in-bits='64' id='acda35bb'/>
      <pointer-type-def type-id='22a55ca6' size-in-bits='64' id='38921430'/>
      <pointer-type-def type-id='0ee576bb' size-in-bits='64' id='629ca5cb'/>
      <pointer-type-def type-id='4fcc4597' size-in-bits='64' id='f94cf1ff'/>
      <pointer-type-def type-id='26527266' size-in-bits='64' id='211c185c'/>
      <pointer-type-def type-id='bae213e3' size-in-bits='64' id='68f92bd7'/>
      <pointer-type-def type-id='e14a26b1' size-in-bits='64' id='8e565e6d'/>
      <pointer-type-def type-id='2ea97d28' size-in-bits='64' id='caa804f2'/>
      <pointer-type-def type-id='0086a11a' size-in-bits='64' id='078f0514'/>
      <pointer-type-def type-id='aee29222' size-in-bits='64' id='d1abd66c'/>
      <pointer-type-def type-id='7c5064e4' size-in-bits='64' id='8052541e'/>
      <function-decl name='__devm_regmap_init' mangled-name='__devm_regmap_init' filepath='drivers/base/regmap/regmap.c' line='1167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__devm_regmap_init'>
        <parameter type-id='fa0b179b' name='dev' filepath='drivers/base/regmap/regmap.c' line='1167' column='1'/>
        <parameter type-id='00e96299' name='bus' filepath='drivers/base/regmap/regmap.c' line='1168' column='1'/>
        <parameter type-id='eaa32e2f' name='bus_context' filepath='drivers/base/regmap/regmap.c' line='1169' column='1'/>
        <parameter type-id='9d19d4a7' name='config' filepath='drivers/base/regmap/regmap.c' line='1170' column='1'/>
        <parameter type-id='a57283f9' name='lock_key' filepath='drivers/base/regmap/regmap.c' line='1171' column='1'/>
        <parameter type-id='80f4b756' name='lock_name' filepath='drivers/base/regmap/regmap.c' line='1172' column='1'/>
        <return type-id='29af9a71'/>
      </function-decl>
      <function-type size-in-bits='64' id='b5732d6f'>
        <parameter type-id='29af9a71'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='3b43e527'>
        <parameter type-id='29af9a71'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='71e3f969'>
        <parameter type-id='29af9a71'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='807869d3'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='7ee67639'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='b4c4ed0b'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='807869d3'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='9f19269b'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='bc6e6178'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='b59d7dce'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='51192447'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='b59d7dce'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='22a55ca6'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='211c185c'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='bae213e3'>
        <return type-id='211c185c'/>
      </function-type>
      <function-type size-in-bits='64' id='e14a26b1'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='b50a4934'/>
      </function-type>
      <function-type size-in-bits='64' id='2ea97d28'>
        <parameter type-id='eaa32e2f'/>
        <return type-id='f0981eeb'/>
      </function-type>
      <function-type size-in-bits='64' id='0086a11a'>
        <parameter type-id='29af9a71'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='aee29222'>
        <parameter type-id='29af9a71'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='7c5064e4'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/base/soc.c' language='LANG_C89'>
      <class-decl name='soc_device' size-in-bits='6272' is-struct='yes' visibility='default' filepath='drivers/base/soc.c' line='24' column='1' id='a353e32f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='dev' type-id='66e487eb' visibility='default' filepath='drivers/base/soc.c' line='25' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6144'>
          <var-decl name='attr' type-id='2dbbe856' visibility='default' filepath='drivers/base/soc.c' line='26' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6208'>
          <var-decl name='soc_dev_num' type-id='95e97e5e' visibility='default' filepath='drivers/base/soc.c' line='27' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='soc_device_attribute' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/sys_soc.h' line='11' column='1' id='81954c90'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='machine' type-id='80f4b756' visibility='default' filepath='include/linux/sys_soc.h' line='12' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='family' type-id='80f4b756' visibility='default' filepath='include/linux/sys_soc.h' line='13' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='revision' type-id='80f4b756' visibility='default' filepath='include/linux/sys_soc.h' line='14' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='serial_number' type-id='80f4b756' visibility='default' filepath='include/linux/sys_soc.h' line='15' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='soc_id' type-id='80f4b756' visibility='default' filepath='include/linux/sys_soc.h' line='16' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='include/linux/sys_soc.h' line='17' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='custom_attr_group' type-id='8ff9530e' visibility='default' filepath='include/linux/sys_soc.h' line='18' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='a353e32f' size-in-bits='64' id='97eb1967'/>
      <pointer-type-def type-id='81954c90' size-in-bits='64' id='2dbbe856'/>
      <function-decl name='soc_device_register' mangled-name='soc_device_register' filepath='drivers/base/soc.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='soc_device_register'>
        <parameter type-id='2dbbe856' name='soc_dev_attr' filepath='drivers/base/soc.c' line='118' column='1'/>
        <return type-id='97eb1967'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/bus/qcom-ebi2.c' language='LANG_C89'>
      <class-decl name='clk' size-in-bits='576' is-struct='yes' visibility='default' is-declaration-only='yes' id='830e3b1b'/>
      <pointer-type-def type-id='830e3b1b' size-in-bits='64' id='7d0bc0eb'/>
      <function-decl name='devm_clk_get' mangled-name='devm_clk_get' filepath='include/linux/clk.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='devm_clk_get'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='80f4b756'/>
        <return type-id='7d0bc0eb'/>
      </function-decl>
      <function-decl name='clk_prepare' mangled-name='clk_prepare' filepath='include/linux/clk.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clk_prepare'>
        <parameter type-id='7d0bc0eb'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='clk_enable' mangled-name='clk_enable' filepath='include/linux/clk.h' line='491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clk_enable'>
        <parameter type-id='7d0bc0eb'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='clk_disable' mangled-name='clk_disable' filepath='include/linux/clk.h' line='519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clk_disable'>
        <parameter type-id='7d0bc0eb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='clk_unprepare' mangled-name='clk_unprepare' filepath='include/linux/clk.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clk_unprepare'>
        <parameter type-id='7d0bc0eb'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/clk/clk-devres.c' language='LANG_C89'>
      <function-decl name='devm_clk_get_optional' mangled-name='devm_clk_get_optional' filepath='drivers/clk/clk-devres.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='devm_clk_get_optional'>
        <parameter type-id='fa0b179b' name='dev' filepath='drivers/clk/clk-devres.c' line='32' column='1'/>
        <parameter type-id='80f4b756' name='id' filepath='drivers/clk/clk-devres.c' line='32' column='1'/>
        <return type-id='7d0bc0eb'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/clk/clk-fixed-factor.c' language='LANG_C89'>
      <function-decl name='clk_register_fixed_factor' mangled-name='clk_register_fixed_factor' filepath='drivers/clk/clk-fixed-factor.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clk_register_fixed_factor'>
        <parameter type-id='fa0b179b' name='dev' filepath='drivers/clk/clk-fixed-factor.c' line='118' column='1'/>
        <parameter type-id='80f4b756' name='name' filepath='drivers/clk/clk-fixed-factor.c' line='118' column='1'/>
        <parameter type-id='80f4b756' name='parent_name' filepath='drivers/clk/clk-fixed-factor.c' line='119' column='1'/>
        <parameter type-id='7359adad' name='flags' filepath='drivers/clk/clk-fixed-factor.c' line='119' column='1'/>
        <parameter type-id='f0981eeb' name='mult' filepath='drivers/clk/clk-fixed-factor.c' line='120' column='1'/>
        <parameter type-id='f0981eeb' name='div' filepath='drivers/clk/clk-fixed-factor.c' line='120' column='1'/>
        <return type-id='7d0bc0eb'/>
      </function-decl>
      <function-decl name='of_match_node' mangled-name='of_match_node' filepath='include/linux/of.h' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='of_match_node'>
        <parameter type-id='e5ce629e'/>
        <parameter type-id='0afa6ea3'/>
        <return type-id='e5ce629e'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/clk/clk-fixed-rate.c' language='LANG_C89'>
      <function-decl name='clk_register_fixed_rate' mangled-name='clk_register_fixed_rate' filepath='drivers/clk/clk-fixed-rate.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clk_register_fixed_rate'>
        <parameter type-id='fa0b179b' name='dev' filepath='drivers/clk/clk-fixed-rate.c' line='101' column='1'/>
        <parameter type-id='80f4b756' name='name' filepath='drivers/clk/clk-fixed-rate.c' line='101' column='1'/>
        <parameter type-id='80f4b756' name='parent_name' filepath='drivers/clk/clk-fixed-rate.c' line='102' column='1'/>
        <parameter type-id='7359adad' name='flags' filepath='drivers/clk/clk-fixed-rate.c' line='102' column='1'/>
        <parameter type-id='7359adad' name='fixed_rate' filepath='drivers/clk/clk-fixed-rate.c' line='103' column='1'/>
        <return type-id='7d0bc0eb'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/clk/clk-gate.c' language='LANG_C89'>
      <class-decl name='device' is-struct='yes' visibility='default' is-declaration-only='yes' id='66e487ec'/>
      <pointer-type-def type-id='66e487ec' size-in-bits='64' id='fa0b179c'/>
      <function-decl name='clk_register_gate' mangled-name='clk_register_gate' filepath='drivers/clk/clk-gate.c' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clk_register_gate'>
        <parameter type-id='fa0b179c' name='dev' filepath='drivers/clk/clk-gate.c' line='184' column='1'/>
        <parameter type-id='80f4b756' name='name' filepath='drivers/clk/clk-gate.c' line='184' column='1'/>
        <parameter type-id='80f4b756' name='parent_name' filepath='drivers/clk/clk-gate.c' line='185' column='1'/>
        <parameter type-id='7359adad' name='flags' filepath='drivers/clk/clk-gate.c' line='185' column='1'/>
        <parameter type-id='eaa32e2f' name='reg' filepath='drivers/clk/clk-gate.c' line='186' column='1'/>
        <parameter type-id='f9b06939' name='bit_idx' filepath='drivers/clk/clk-gate.c' line='186' column='1'/>
        <parameter type-id='f9b06939' name='clk_gate_flags' filepath='drivers/clk/clk-gate.c' line='187' column='1'/>
        <parameter type-id='cff2d845' name='lock' filepath='drivers/clk/clk-gate.c' line='187' column='1'/>
        <return type-id='7d0bc0eb'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/clk/clk.c' language='LANG_C89'>
      <class-decl name='clk_hw' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/clk-provider.h' line='326' column='1' id='cf8d7d81'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='core' type-id='ba21e62b' visibility='default' filepath='include/linux/clk-provider.h' line='327' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='clk' type-id='7d0bc0eb' visibility='default' filepath='include/linux/clk-provider.h' line='328' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='init' type-id='b6a95a02' visibility='default' filepath='include/linux/clk-provider.h' line='329' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='clk_core' size-in-bits='1984' is-struct='yes' visibility='default' filepath='drivers/clk/clk.c' line='56' column='1' id='636cc9ab'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='drivers/clk/clk.c' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='ops' type-id='824ffa73' visibility='default' filepath='drivers/clk/clk.c' line='58' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='hw' type-id='3aaeef89' visibility='default' filepath='drivers/clk/clk.c' line='59' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='owner' type-id='2730d016' visibility='default' filepath='drivers/clk/clk.c' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='dev' type-id='fa0b179b' visibility='default' filepath='drivers/clk/clk.c' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='of_node' type-id='9a537bbe' visibility='default' filepath='drivers/clk/clk.c' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='parent' type-id='ba21e62b' visibility='default' filepath='drivers/clk/clk.c' line='63' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='parents' type-id='338d484d' visibility='default' filepath='drivers/clk/clk.c' line='64' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='num_parents' type-id='f9b06939' visibility='default' filepath='drivers/clk/clk.c' line='65' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='520'>
          <var-decl name='new_parent_index' type-id='f9b06939' visibility='default' filepath='drivers/clk/clk.c' line='66' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='rate' type-id='7359adad' visibility='default' filepath='drivers/clk/clk.c' line='67' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='req_rate' type-id='7359adad' visibility='default' filepath='drivers/clk/clk.c' line='68' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='new_rate' type-id='7359adad' visibility='default' filepath='drivers/clk/clk.c' line='69' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='new_parent' type-id='ba21e62b' visibility='default' filepath='drivers/clk/clk.c' line='70' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='new_child' type-id='ba21e62b' visibility='default' filepath='drivers/clk/clk.c' line='71' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='flags' type-id='7359adad' visibility='default' filepath='drivers/clk/clk.c' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='orphan' type-id='b50a4934' visibility='default' filepath='drivers/clk/clk.c' line='73' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='968'>
          <var-decl name='rpm_enabled' type-id='b50a4934' visibility='default' filepath='drivers/clk/clk.c' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='976'>
          <var-decl name='need_sync' type-id='b50a4934' visibility='default' filepath='drivers/clk/clk.c' line='75' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='984'>
          <var-decl name='boot_enabled' type-id='b50a4934' visibility='default' filepath='drivers/clk/clk.c' line='76' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='992'>
          <var-decl name='enable_count' type-id='f0981eeb' visibility='default' filepath='drivers/clk/clk.c' line='77' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='prepare_count' type-id='f0981eeb' visibility='default' filepath='drivers/clk/clk.c' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1056'>
          <var-decl name='protect_count' type-id='f0981eeb' visibility='default' filepath='drivers/clk/clk.c' line='79' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='min_rate' type-id='7359adad' visibility='default' filepath='drivers/clk/clk.c' line='80' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='max_rate' type-id='7359adad' visibility='default' filepath='drivers/clk/clk.c' line='81' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='accuracy' type-id='7359adad' visibility='default' filepath='drivers/clk/clk.c' line='82' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='phase' type-id='95e97e5e' visibility='default' filepath='drivers/clk/clk.c' line='83' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1312'>
          <var-decl name='duty' type-id='4f935e80' visibility='default' filepath='drivers/clk/clk.c' line='84' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='children' type-id='e151255a' visibility='default' filepath='drivers/clk/clk.c' line='85' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='child_node' type-id='03a4a074' visibility='default' filepath='drivers/clk/clk.c' line='86' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='clks' type-id='e151255a' visibility='default' filepath='drivers/clk/clk.c' line='87' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='notifier_count' type-id='f0981eeb' visibility='default' filepath='drivers/clk/clk.c' line='88' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='dentry' type-id='27675065' visibility='default' filepath='drivers/clk/clk.c' line='90' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='debug_node' type-id='03a4a074' visibility='default' filepath='drivers/clk/clk.c' line='91' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='ref' type-id='400fb07b' visibility='default' filepath='drivers/clk/clk.c' line='93' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='clk_ops' size-in-bits='1728' is-struct='yes' visibility='default' filepath='include/linux/clk-provider.h' line='228' column='1' id='512851e8'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='prepare' type-id='2d015d73' visibility='default' filepath='include/linux/clk-provider.h' line='229' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='unprepare' type-id='0112fb3c' visibility='default' filepath='include/linux/clk-provider.h' line='230' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='is_prepared' type-id='2d015d73' visibility='default' filepath='include/linux/clk-provider.h' line='231' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='unprepare_unused' type-id='0112fb3c' visibility='default' filepath='include/linux/clk-provider.h' line='232' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='enable' type-id='2d015d73' visibility='default' filepath='include/linux/clk-provider.h' line='233' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='disable' type-id='0112fb3c' visibility='default' filepath='include/linux/clk-provider.h' line='234' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='is_enabled' type-id='2d015d73' visibility='default' filepath='include/linux/clk-provider.h' line='235' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='disable_unused' type-id='0112fb3c' visibility='default' filepath='include/linux/clk-provider.h' line='236' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='save_context' type-id='2d015d73' visibility='default' filepath='include/linux/clk-provider.h' line='237' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='restore_context' type-id='0112fb3c' visibility='default' filepath='include/linux/clk-provider.h' line='238' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='recalc_rate' type-id='93097cd2' visibility='default' filepath='include/linux/clk-provider.h' line='239' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='round_rate' type-id='1eac8fa1' visibility='default' filepath='include/linux/clk-provider.h' line='241' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='determine_rate' type-id='c2c32efe' visibility='default' filepath='include/linux/clk-provider.h' line='243' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='set_parent' type-id='a05e478f' visibility='default' filepath='include/linux/clk-provider.h' line='245' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='get_parent' type-id='38527a92' visibility='default' filepath='include/linux/clk-provider.h' line='246' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='set_rate' type-id='3d287e03' visibility='default' filepath='include/linux/clk-provider.h' line='247' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='set_rate_and_parent' type-id='d598c37f' visibility='default' filepath='include/linux/clk-provider.h' line='249' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='recalc_accuracy' type-id='93097cd2' visibility='default' filepath='include/linux/clk-provider.h' line='252' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='get_phase' type-id='2d015d73' visibility='default' filepath='include/linux/clk-provider.h' line='254' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='set_phase' type-id='eeb35eda' visibility='default' filepath='include/linux/clk-provider.h' line='255' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='get_duty_cycle' type-id='3993d336' visibility='default' filepath='include/linux/clk-provider.h' line='256' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='set_duty_cycle' type-id='3993d336' visibility='default' filepath='include/linux/clk-provider.h' line='258' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='init' type-id='2d015d73' visibility='default' filepath='include/linux/clk-provider.h' line='260' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='terminate' type-id='0112fb3c' visibility='default' filepath='include/linux/clk-provider.h' line='261' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='debug_init' type-id='c2d2a400' visibility='default' filepath='include/linux/clk-provider.h' line='262' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='pre_rate_change' type-id='3d287e03' visibility='default' filepath='include/linux/clk-provider.h' line='263' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='post_rate_change' type-id='3d287e03' visibility='default' filepath='include/linux/clk-provider.h' line='266' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='clk_rate_request' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/clk-provider.h' line='56' column='1' id='e9bea70c'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='rate' type-id='7359adad' visibility='default' filepath='include/linux/clk-provider.h' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='min_rate' type-id='7359adad' visibility='default' filepath='include/linux/clk-provider.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='max_rate' type-id='7359adad' visibility='default' filepath='include/linux/clk-provider.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='best_parent_rate' type-id='7359adad' visibility='default' filepath='include/linux/clk-provider.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='best_parent_hw' type-id='3aaeef89' visibility='default' filepath='include/linux/clk-provider.h' line='61' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='clk_duty' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/clk-provider.h' line='70' column='1' id='4f935e80'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='num' type-id='f0981eeb' visibility='default' filepath='include/linux/clk-provider.h' line='71' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='den' type-id='f0981eeb' visibility='default' filepath='include/linux/clk-provider.h' line='72' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/linux/fs.h' line='692' column='1' id='f8cbf453'>
        <data-member access='private'>
          <var-decl name='i_pipe' type-id='15d29710' visibility='default' filepath='include/linux/fs.h' line='693' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='i_bdev' type-id='b88dd945' visibility='default' filepath='include/linux/fs.h' line='694' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='i_cdev' type-id='3e6eb939' visibility='default' filepath='include/linux/fs.h' line='695' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='i_link' type-id='26a90f95' visibility='default' filepath='include/linux/fs.h' line='696' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='i_dir_seq' type-id='f0981eeb' visibility='default' filepath='include/linux/fs.h' line='697' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='clk_parent_map' size-in-bits='320' is-struct='yes' visibility='default' filepath='drivers/clk/clk.c' line='48' column='1' id='710f82fd'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='hw' type-id='9e6d4b4e' visibility='default' filepath='drivers/clk/clk.c' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='core' type-id='ba21e62b' visibility='default' filepath='drivers/clk/clk.c' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='fw_name' type-id='80f4b756' visibility='default' filepath='drivers/clk/clk.c' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='drivers/clk/clk.c' line='52' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='index' type-id='95e97e5e' visibility='default' filepath='drivers/clk/clk.c' line='53' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='clk_init_data' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/clk-provider.h' line='299' column='1' id='065eee5b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/clk-provider.h' line='300' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='ops' type-id='824ffa73' visibility='default' filepath='include/linux/clk-provider.h' line='301' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='parent_names' type-id='13956559' visibility='default' filepath='include/linux/clk-provider.h' line='303' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='parent_data' type-id='4cdbecf4' visibility='default' filepath='include/linux/clk-provider.h' line='304' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='parent_hws' type-id='ca0dae6c' visibility='default' filepath='include/linux/clk-provider.h' line='305' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='num_parents' type-id='f9b06939' visibility='default' filepath='include/linux/clk-provider.h' line='306' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='flags' type-id='7359adad' visibility='default' filepath='include/linux/clk-provider.h' line='307' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='clk_parent_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/clk-provider.h' line='278' column='1' id='bd5c3911'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='hw' type-id='9e6d4b4e' visibility='default' filepath='include/linux/clk-provider.h' line='279' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='fw_name' type-id='80f4b756' visibility='default' filepath='include/linux/clk-provider.h' line='280' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/clk-provider.h' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='index' type-id='95e97e5e' visibility='default' filepath='include/linux/clk-provider.h' line='282' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='824a7fd2' size-in-bits='64' id='f1c652ac'/>
      <pointer-type-def type-id='636cc9ab' size-in-bits='64' id='ba21e62b'/>
      <pointer-type-def type-id='4f935e80' size-in-bits='64' id='f726dab6'/>
      <pointer-type-def type-id='cf8d7d81' size-in-bits='64' id='3aaeef89'/>
      <pointer-type-def type-id='710f82fd' size-in-bits='64' id='338d484d'/>
      <pointer-type-def type-id='e9bea70c' size-in-bits='64' id='23a0ad0a'/>
      <qualified-type-def type-id='cf8d7d81' const='yes' id='fdb55010'/>
      <pointer-type-def type-id='fdb55010' size-in-bits='64' id='9e6d4b4e'/>
      <pointer-type-def type-id='9e6d4b4e' size-in-bits='64' id='ca0dae6c'/>
      <qualified-type-def type-id='065eee5b' const='yes' id='d7aa071c'/>
      <pointer-type-def type-id='d7aa071c' size-in-bits='64' id='b6a95a02'/>
      <qualified-type-def type-id='512851e8' const='yes' id='92072f8b'/>
      <pointer-type-def type-id='92072f8b' size-in-bits='64' id='824ffa73'/>
      <qualified-type-def type-id='bd5c3911' const='yes' id='dcc94796'/>
      <pointer-type-def type-id='dcc94796' size-in-bits='64' id='4cdbecf4'/>
      <pointer-type-def type-id='f5a529af' size-in-bits='64' id='2d015d73'/>
      <pointer-type-def type-id='73b85a24' size-in-bits='64' id='3993d336'/>
      <pointer-type-def type-id='f867473c' size-in-bits='64' id='c2c32efe'/>
      <pointer-type-def type-id='fc053d58' size-in-bits='64' id='eeb35eda'/>
      <pointer-type-def type-id='8de1c3db' size-in-bits='64' id='a05e478f'/>
      <pointer-type-def type-id='2e5f4f0f' size-in-bits='64' id='3d287e03'/>
      <pointer-type-def type-id='59f7b4bb' size-in-bits='64' id='d598c37f'/>
      <pointer-type-def type-id='7fb4efa5' size-in-bits='64' id='1eac8fa1'/>
      <pointer-type-def type-id='d49e6088' size-in-bits='64' id='38527a92'/>
      <pointer-type-def type-id='0a38a8f0' size-in-bits='64' id='93097cd2'/>
      <pointer-type-def type-id='30913582' size-in-bits='64' id='0112fb3c'/>
      <pointer-type-def type-id='7c1f247e' size-in-bits='64' id='c2d2a400'/>
      <function-decl name='clk_hw_get_name' mangled-name='clk_hw_get_name' filepath='drivers/clk/clk.c' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clk_hw_get_name'>
        <parameter type-id='9e6d4b4e' name='hw' filepath='drivers/clk/clk.c' line='272' column='1'/>
        <return type-id='80f4b756'/>
      </function-decl>
      <function-decl name='__clk_get_hw' mangled-name='__clk_get_hw' filepath='drivers/clk/clk.c' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__clk_get_hw'>
        <parameter type-id='7d0bc0eb' name='clk' filepath='drivers/clk/clk.c' line='278' column='1'/>
        <return type-id='3aaeef89'/>
      </function-decl>
      <function-decl name='clk_hw_get_parent' mangled-name='clk_hw_get_parent' filepath='drivers/clk/clk.c' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clk_hw_get_parent'>
        <parameter type-id='9e6d4b4e' name='hw' filepath='drivers/clk/clk.c' line='290' column='1'/>
        <return type-id='3aaeef89'/>
      </function-decl>
      <function-decl name='clk_get_rate' mangled-name='clk_get_rate' filepath='drivers/clk/clk.c' line='1664' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clk_get_rate'>
        <parameter type-id='7d0bc0eb' name='clk' filepath='drivers/clk/clk.c' line='1664' column='1'/>
        <return type-id='7359adad'/>
      </function-decl>
      <function-decl name='clk_register' mangled-name='clk_register' filepath='drivers/clk/clk.c' line='3929' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clk_register'>
        <parameter type-id='fa0b179b' name='dev' filepath='drivers/clk/clk.c' line='3929' column='1'/>
        <parameter type-id='3aaeef89' name='hw' filepath='drivers/clk/clk.c' line='3929' column='1'/>
        <return type-id='7d0bc0eb'/>
      </function-decl>
      <function-decl name='of_clk_src_onecell_get' mangled-name='of_clk_src_onecell_get' filepath='drivers/clk/clk.c' line='4426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='of_clk_src_onecell_get'>
        <parameter type-id='51a94113' name='clkspec' filepath='drivers/clk/clk.c' line='4426' column='1'/>
        <parameter type-id='eaa32e2f' name='data' filepath='drivers/clk/clk.c' line='4426' column='1'/>
        <return type-id='7d0bc0eb'/>
      </function-decl>
      <function-decl name='of_clk_add_provider' mangled-name='of_clk_add_provider' filepath='drivers/clk/clk.c' line='4463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='of_clk_add_provider'>
        <parameter type-id='9a537bbe' name='np' filepath='drivers/clk/clk.c' line='4463' column='1'/>
        <parameter type-id='f1c652ac' name='clk_src_get' filepath='drivers/clk/clk.c' line='4464' column='1'/>
        <parameter type-id='eaa32e2f' name='data' filepath='drivers/clk/clk.c' line='4466' column='1'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-type size-in-bits='64' id='824a7fd2'>
        <parameter type-id='51a94113' name='clkspec'/>
        <parameter type-id='eaa32e2f' name='data'/>
        <return type-id='7d0bc0eb'/>
      </function-type>
      <function-type size-in-bits='64' id='f5a529af'>
        <parameter type-id='3aaeef89'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='73b85a24'>
        <parameter type-id='3aaeef89'/>
        <parameter type-id='f726dab6'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='f867473c'>
        <parameter type-id='3aaeef89'/>
        <parameter type-id='23a0ad0a'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='fc053d58'>
        <parameter type-id='3aaeef89'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='8de1c3db'>
        <parameter type-id='3aaeef89'/>
        <parameter type-id='f9b06939'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='2e5f4f0f'>
        <parameter type-id='3aaeef89'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='7359adad'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='59f7b4bb'>
        <parameter type-id='3aaeef89'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='f9b06939'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='7fb4efa5'>
        <parameter type-id='3aaeef89'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='1d2c2b85'/>
        <return type-id='bd54fe1a'/>
      </function-type>
      <function-type size-in-bits='64' id='d49e6088'>
        <parameter type-id='3aaeef89'/>
        <return type-id='f9b06939'/>
      </function-type>
      <function-type size-in-bits='64' id='0a38a8f0'>
        <parameter type-id='3aaeef89'/>
        <parameter type-id='7359adad'/>
        <return type-id='7359adad'/>
      </function-type>
      <function-type size-in-bits='64' id='30913582'>
        <parameter type-id='3aaeef89'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='7c1f247e'>
        <parameter type-id='3aaeef89'/>
        <parameter type-id='27675065'/>
        <return type-id='48b5725f'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/clk/clkdev.c' language='LANG_C89'>
      <function-decl name='clk_register_clkdev' mangled-name='clk_register_clkdev' filepath='drivers/clk/clkdev.c' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clk_register_clkdev'>
        <parameter type-id='7d0bc0eb' name='clk' filepath='drivers/clk/clkdev.c' line='341' column='1'/>
        <parameter type-id='80f4b756' name='con_id' filepath='drivers/clk/clkdev.c' line='341' column='1'/>
        <parameter type-id='80f4b756' name='dev_id' filepath='drivers/clk/clkdev.c' line='342' column='1'/>
        <return type-id='95e97e5e'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/clk/hisilicon/clk-hi6220-stub.c' language='LANG_C89'>
      <function-decl name='syscon_regmap_lookup_by_phandle' mangled-name='syscon_regmap_lookup_by_phandle' filepath='include/linux/mfd/syscon.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='syscon_regmap_lookup_by_phandle'>
        <parameter type-id='9a537bbe'/>
        <parameter type-id='80f4b756'/>
        <return type-id='29af9a71'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='drivers/dma/dmaengine.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='7fdcd183' size-in-bits='infinite' id='e5c7d3c7'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='cf29c9b3' size-in-bits='infinite' id='55685a92'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <class-decl name='dma_chan' size-in-bits='896' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='313' column='1' id='5e3b10ab'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='device' type-id='c60ba652' visibility='default' filepath='include/linux/dmaengine.h' line='314' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='slave' type-id='fa0b179b' visibility='default' filepath='include/linux/dmaengine.h' line='315' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='cookie' type-id='6478ea0a' visibility='default' filepath='include/linux/dmaengine.h' line='316' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='completed_cookie' type-id='6478ea0a' visibility='default' filepath='include/linux/dmaengine.h' line='317' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='chan_id' type-id='95e97e5e' visibility='default' filepath='include/linux/dmaengine.h' line='320' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='dev' type-id='114d14e4' visibility='default' filepath='include/linux/dmaengine.h' line='321' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='include/linux/dmaengine.h' line='322' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='dbg_client_name' type-id='26a90f95' visibility='default' filepath='include/linux/dmaengine.h' line='324' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='device_node' type-id='72f469ec' visibility='default' filepath='include/linux/dmaengine.h' line='327' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='local' type-id='f8c8e796' visibility='default' filepath='include/linux/dmaengine.h' line='328' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='client_count' type-id='95e97e5e' visibility='default' filepath='include/linux/dmaengine.h' line='329' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='672'>
          <var-decl name='table_count' type-id='95e97e5e' visibility='default' filepath='include/linux/dmaengine.h' line='330' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='router' type-id='70a92833' visibility='default' filepath='include/linux/dmaengine.h' line='333' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='route_data' type-id='eaa32e2f' visibility='default' filepath='include/linux/dmaengine.h' line='334' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='private' type-id='eaa32e2f' visibility='default' filepath='include/linux/dmaengine.h' line='336' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='dma_device' size-in-bits='3136' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='816' column='1' id='0dcaa1e4'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='ref' type-id='400fb07b' visibility='default' filepath='include/linux/dmaengine.h' line='817' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='chancnt' type-id='f0981eeb' visibility='default' filepath='include/linux/dmaengine.h' line='818' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='privatecnt' type-id='f0981eeb' visibility='default' filepath='include/linux/dmaengine.h' line='819' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='channels' type-id='72f469ec' visibility='default' filepath='include/linux/dmaengine.h' line='820' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='global_node' type-id='72f469ec' visibility='default' filepath='include/linux/dmaengine.h' line='821' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='filter' type-id='d914dc7c' visibility='default' filepath='include/linux/dmaengine.h' line='822' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='cap_mask' type-id='3fb29acd' visibility='default' filepath='include/linux/dmaengine.h' line='823' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='desc_metadata_modes' type-id='8ae66bc4' visibility='default' filepath='include/linux/dmaengine.h' line='824' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='672'>
          <var-decl name='max_xor' type-id='8efea9e5' visibility='default' filepath='include/linux/dmaengine.h' line='825' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='688'>
          <var-decl name='max_pq' type-id='8efea9e5' visibility='default' filepath='include/linux/dmaengine.h' line='826' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='copy_align' type-id='ec506a0a' visibility='default' filepath='include/linux/dmaengine.h' line='827' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='736'>
          <var-decl name='xor_align' type-id='ec506a0a' visibility='default' filepath='include/linux/dmaengine.h' line='828' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='pq_align' type-id='ec506a0a' visibility='default' filepath='include/linux/dmaengine.h' line='829' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='800'>
          <var-decl name='fill_align' type-id='ec506a0a' visibility='default' filepath='include/linux/dmaengine.h' line='830' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='dev_id' type-id='95e97e5e' visibility='default' filepath='include/linux/dmaengine.h' line='833' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='dev' type-id='fa0b179b' visibility='default' filepath='include/linux/dmaengine.h' line='834' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='owner' type-id='2730d016' visibility='default' filepath='include/linux/dmaengine.h' line='835' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='chan_ida' type-id='46ce60fb' visibility='default' filepath='include/linux/dmaengine.h' line='836' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='chan_mutex' type-id='925167dc' visibility='default' filepath='include/linux/dmaengine.h' line='837' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='src_addr_widths' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='839' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1440'>
          <var-decl name='dst_addr_widths' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='840' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='directions' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='841' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1504'>
          <var-decl name='max_burst' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='842' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='descriptor_reuse' type-id='b50a4934' visibility='default' filepath='include/linux/dmaengine.h' line='843' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1568'>
          <var-decl name='residue_granularity' type-id='cad02db3' visibility='default' filepath='include/linux/dmaengine.h' line='844' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='device_alloc_chan_resources' type-id='8425c356' visibility='default' filepath='include/linux/dmaengine.h' line='846' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='device_free_chan_resources' type-id='42e84365' visibility='default' filepath='include/linux/dmaengine.h' line='847' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='device_prep_dma_memcpy' type-id='16a27d24' visibility='default' filepath='include/linux/dmaengine.h' line='849' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='device_prep_dma_xor' type-id='d37a2705' visibility='default' filepath='include/linux/dmaengine.h' line='852' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='device_prep_dma_xor_val' type-id='187c2c79' visibility='default' filepath='include/linux/dmaengine.h' line='855' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='device_prep_dma_pq' type-id='2fa81f80' visibility='default' filepath='include/linux/dmaengine.h' line='858' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='device_prep_dma_pq_val' type-id='35da6582' visibility='default' filepath='include/linux/dmaengine.h' line='862' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='device_prep_dma_memset' type-id='9c36e869' visibility='default' filepath='include/linux/dmaengine.h' line='866' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='device_prep_dma_memset_sg' type-id='81ec80b0' visibility='default' filepath='include/linux/dmaengine.h' line='869' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='device_prep_dma_interrupt' type-id='37513679' visibility='default' filepath='include/linux/dmaengine.h' line='872' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='device_prep_slave_sg' type-id='3cbeb812' visibility='default' filepath='include/linux/dmaengine.h' line='875' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='device_prep_dma_cyclic' type-id='f166bad0' visibility='default' filepath='include/linux/dmaengine.h' line='879' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='device_prep_interleaved_dma' type-id='3e2efc02' visibility='default' filepath='include/linux/dmaengine.h' line='883' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='device_prep_dma_imm_data' type-id='7be3d1f9' visibility='default' filepath='include/linux/dmaengine.h' line='886' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='device_config' type-id='81aefe59' visibility='default' filepath='include/linux/dmaengine.h' line='890' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='device_pause' type-id='8425c356' visibility='default' filepath='include/linux/dmaengine.h' line='892' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='device_resume' type-id='8425c356' visibility='default' filepath='include/linux/dmaengine.h' line='893' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='device_terminate_all' type-id='8425c356' visibility='default' filepath='include/linux/dmaengine.h' line='894' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='device_synchronize' type-id='42e84365' visibility='default' filepath='include/linux/dmaengine.h' line='895' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='device_tx_status' type-id='e4038107' visibility='default' filepath='include/linux/dmaengine.h' line='897' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2880'>
          <var-decl name='device_issue_pending' type-id='42e84365' visibility='default' filepath='include/linux/dmaengine.h' line='900' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2944'>
          <var-decl name='device_release' type-id='75adfaf3' visibility='default' filepath='include/linux/dmaengine.h' line='901' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3008'>
          <var-decl name='dbg_summary_show' type-id='4127e705' visibility='default' filepath='include/linux/dmaengine.h' line='904' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3072'>
          <var-decl name='dbg_dev_root' type-id='27675065' visibility='default' filepath='include/linux/dmaengine.h' line='905' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='dma_filter' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='740' column='1' id='d914dc7c'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='fn' type-id='55f53546' visibility='default' filepath='include/linux/dmaengine.h' line='741' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='mapcnt' type-id='95e97e5e' visibility='default' filepath='include/linux/dmaengine.h' line='742' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='map' type-id='06cc3383' visibility='default' filepath='include/linux/dmaengine.h' line='743' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='dma_filter_fn' type-id='aa8ac136' filepath='include/linux/dmaengine.h' line='507' column='1' id='55f53546'/>
      <class-decl name='dma_slave_map' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='727' column='1' id='848612dc'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='devname' type-id='80f4b756' visibility='default' filepath='include/linux/dmaengine.h' line='728' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='slave' type-id='80f4b756' visibility='default' filepath='include/linux/dmaengine.h' line='729' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='param' type-id='eaa32e2f' visibility='default' filepath='include/linux/dmaengine.h' line='730' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='dma_cap_mask_t' type-id='2f320200' filepath='include/linux/dmaengine.h' line='214' column='1' id='3fb29acd'/>
      <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='3fb29acd' visibility='default' filepath='include/linux/dmaengine.h' line='214' column='1' id='2f320200'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='bits' type-id='f066dd3c' visibility='default' filepath='include/linux/dmaengine.h' line='214' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='dma_desc_metadata_mode' filepath='include/linux/dmaengine.h' line='272' column='1' id='8ae66bc4'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='DESC_METADATA_NONE' value='0'/>
        <enumerator name='DESC_METADATA_CLIENT' value='1'/>
        <enumerator name='DESC_METADATA_ENGINE' value='2'/>
      </enum-decl>
      <enum-decl name='dmaengine_alignment' filepath='include/linux/dmaengine.h' line='710' column='1' id='ec506a0a'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='DMAENGINE_ALIGN_1_BYTE' value='0'/>
        <enumerator name='DMAENGINE_ALIGN_2_BYTES' value='1'/>
        <enumerator name='DMAENGINE_ALIGN_4_BYTES' value='2'/>
        <enumerator name='DMAENGINE_ALIGN_8_BYTES' value='3'/>
        <enumerator name='DMAENGINE_ALIGN_16_BYTES' value='4'/>
        <enumerator name='DMAENGINE_ALIGN_32_BYTES' value='5'/>
        <enumerator name='DMAENGINE_ALIGN_64_BYTES' value='6'/>
      </enum-decl>
      <enum-decl name='dma_residue_granularity' filepath='include/linux/dmaengine.h' line='452' column='1' id='cad02db3'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='DMA_RESIDUE_GRANULARITY_DESCRIPTOR' value='0'/>
        <enumerator name='DMA_RESIDUE_GRANULARITY_SEGMENT' value='1'/>
        <enumerator name='DMA_RESIDUE_GRANULARITY_BURST' value='2'/>
      </enum-decl>
      <class-decl name='dma_async_tx_descriptor' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='576' column='1' id='b50ce591'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='cookie' type-id='6478ea0a' visibility='default' filepath='include/linux/dmaengine.h' line='577' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='flags' type-id='04baee86' visibility='default' filepath='include/linux/dmaengine.h' line='578' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='phys' type-id='cf29c9b3' visibility='default' filepath='include/linux/dmaengine.h' line='579' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='chan' type-id='27f3f5d9' visibility='default' filepath='include/linux/dmaengine.h' line='580' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='tx_submit' type-id='fb8c75c5' visibility='default' filepath='include/linux/dmaengine.h' line='581' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='desc_free' type-id='dccdb2b1' visibility='default' filepath='include/linux/dmaengine.h' line='582' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='callback' type-id='ee3f36d4' visibility='default' filepath='include/linux/dmaengine.h' line='583' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='callback_result' type-id='82615040' visibility='default' filepath='include/linux/dmaengine.h' line='584' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='callback_param' type-id='eaa32e2f' visibility='default' filepath='include/linux/dmaengine.h' line='585' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='unmap' type-id='e220a5e2' visibility='default' filepath='include/linux/dmaengine.h' line='586' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='desc_metadata_mode' type-id='8ae66bc4' visibility='default' filepath='include/linux/dmaengine.h' line='587' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='metadata_ops' type-id='924ae97c' visibility='default' filepath='include/linux/dmaengine.h' line='588' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='dma_cookie_t' type-id='a7832498' filepath='include/linux/dmaengine.h' line='22' column='1' id='6478ea0a'/>
      <enum-decl name='dma_ctrl_flags' filepath='include/linux/dmaengine.h' line='180' column='1' id='04baee86'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='DMA_PREP_INTERRUPT' value='1'/>
        <enumerator name='DMA_CTRL_ACK' value='2'/>
        <enumerator name='DMA_PREP_PQ_DISABLE_P' value='4'/>
        <enumerator name='DMA_PREP_PQ_DISABLE_Q' value='8'/>
        <enumerator name='DMA_PREP_CONTINUE' value='16'/>
        <enumerator name='DMA_PREP_FENCE' value='32'/>
        <enumerator name='DMA_CTRL_REUSE' value='64'/>
        <enumerator name='DMA_PREP_CMD' value='128'/>
      </enum-decl>
      <typedef-decl name='dma_async_tx_callback' type-id='b7f9d8e6' filepath='include/linux/dmaengine.h' line='509' column='1' id='ee3f36d4'/>
      <typedef-decl name='dma_async_tx_callback_result' type-id='31316b61' filepath='include/linux/dmaengine.h' line='523' column='1' id='82615040'/>
      <class-decl name='dmaengine_result' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='518' column='1' id='931aa361'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='result' type-id='c2154237' visibility='default' filepath='include/linux/dmaengine.h' line='519' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='residue' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='520' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='dmaengine_tx_result' filepath='include/linux/dmaengine.h' line='511' column='1' id='c2154237'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='DMA_TRANS_NOERROR' value='0'/>
        <enumerator name='DMA_TRANS_READ_FAILED' value='1'/>
        <enumerator name='DMA_TRANS_WRITE_FAILED' value='2'/>
        <enumerator name='DMA_TRANS_ABORTED' value='3'/>
      </enum-decl>
      <class-decl name='dmaengine_unmap_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='526' column='1' id='b32b9ce4'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='map_cnt' type-id='f9b06939' visibility='default' filepath='include/linux/dmaengine.h' line='530' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='to_cnt' type-id='f9b06939' visibility='default' filepath='include/linux/dmaengine.h' line='532' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='from_cnt' type-id='f9b06939' visibility='default' filepath='include/linux/dmaengine.h' line='533' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='bidi_cnt' type-id='f9b06939' visibility='default' filepath='include/linux/dmaengine.h' line='534' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='dev' type-id='fa0b179b' visibility='default' filepath='include/linux/dmaengine.h' line='535' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='kref' type-id='400fb07b' visibility='default' filepath='include/linux/dmaengine.h' line='536' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='len' type-id='b59d7dce' visibility='default' filepath='include/linux/dmaengine.h' line='537' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='addr' type-id='55685a92' visibility='default' filepath='include/linux/dmaengine.h' line='538' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='dma_descriptor_metadata_ops' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='543' column='1' id='dbae75d6'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='attach' type-id='7a89a746' visibility='default' filepath='include/linux/dmaengine.h' line='544' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='get_ptr' type-id='b698e72c' visibility='default' filepath='include/linux/dmaengine.h' line='547' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='set_len' type-id='8f20abb2' visibility='default' filepath='include/linux/dmaengine.h' line='549' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='sum_check_flags' filepath='include/linux/dmaengine.h' line='204' column='1' id='a46c8018'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='SUM_CHECK_P_RESULT' value='1'/>
        <enumerator name='SUM_CHECK_Q_RESULT' value='2'/>
      </enum-decl>
      <enum-decl name='dma_transfer_direction' filepath='include/linux/dmaengine.h' line='75' column='1' id='941ca9e2'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='DMA_MEM_TO_MEM' value='0'/>
        <enumerator name='DMA_MEM_TO_DEV' value='1'/>
        <enumerator name='DMA_DEV_TO_MEM' value='2'/>
        <enumerator name='DMA_DEV_TO_DEV' value='3'/>
        <enumerator name='DMA_TRANS_NONE' value='4'/>
      </enum-decl>
      <class-decl name='dma_interleaved_template' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='146' column='1' id='543d1e64'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='src_start' type-id='cf29c9b3' visibility='default' filepath='include/linux/dmaengine.h' line='147' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='dst_start' type-id='cf29c9b3' visibility='default' filepath='include/linux/dmaengine.h' line='148' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='dir' type-id='941ca9e2' visibility='default' filepath='include/linux/dmaengine.h' line='149' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='src_inc' type-id='b50a4934' visibility='default' filepath='include/linux/dmaengine.h' line='150' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='168'>
          <var-decl name='dst_inc' type-id='b50a4934' visibility='default' filepath='include/linux/dmaengine.h' line='151' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='176'>
          <var-decl name='src_sgl' type-id='b50a4934' visibility='default' filepath='include/linux/dmaengine.h' line='152' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='184'>
          <var-decl name='dst_sgl' type-id='b50a4934' visibility='default' filepath='include/linux/dmaengine.h' line='153' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='numf' type-id='b59d7dce' visibility='default' filepath='include/linux/dmaengine.h' line='154' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='frame_size' type-id='b59d7dce' visibility='default' filepath='include/linux/dmaengine.h' line='155' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='sgl' type-id='e5c7d3c7' visibility='default' filepath='include/linux/dmaengine.h' line='156' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='data_chunk' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='121' column='1' id='7fdcd183'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='include/linux/dmaengine.h' line='122' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='icg' type-id='b59d7dce' visibility='default' filepath='include/linux/dmaengine.h' line='123' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='dst_icg' type-id='b59d7dce' visibility='default' filepath='include/linux/dmaengine.h' line='124' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='src_icg' type-id='b59d7dce' visibility='default' filepath='include/linux/dmaengine.h' line='125' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='dma_slave_config' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='418' column='1' id='d356829c'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='direction' type-id='941ca9e2' visibility='default' filepath='include/linux/dmaengine.h' line='419' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='src_addr' type-id='2522883d' visibility='default' filepath='include/linux/dmaengine.h' line='420' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='dst_addr' type-id='2522883d' visibility='default' filepath='include/linux/dmaengine.h' line='421' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='src_addr_width' type-id='270e7659' visibility='default' filepath='include/linux/dmaengine.h' line='422' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='dst_addr_width' type-id='270e7659' visibility='default' filepath='include/linux/dmaengine.h' line='423' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='src_maxburst' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='424' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='288'>
          <var-decl name='dst_maxburst' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='425' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='src_port_window_size' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='426' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='352'>
          <var-decl name='dst_port_window_size' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='427' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='device_fc' type-id='b50a4934' visibility='default' filepath='include/linux/dmaengine.h' line='428' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='416'>
          <var-decl name='slave_id' type-id='f0981eeb' visibility='default' filepath='include/linux/dmaengine.h' line='429' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='dma_slave_buswidth' filepath='include/linux/dmaengine.h' line='355' column='1' id='270e7659'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='DMA_SLAVE_BUSWIDTH_UNDEFINED' value='0'/>
        <enumerator name='DMA_SLAVE_BUSWIDTH_1_BYTE' value='1'/>
        <enumerator name='DMA_SLAVE_BUSWIDTH_2_BYTES' value='2'/>
        <enumerator name='DMA_SLAVE_BUSWIDTH_3_BYTES' value='3'/>
        <enumerator name='DMA_SLAVE_BUSWIDTH_4_BYTES' value='4'/>
        <enumerator name='DMA_SLAVE_BUSWIDTH_8_BYTES' value='8'/>
        <enumerator name='DMA_SLAVE_BUSWIDTH_16_BYTES' value='16'/>
        <enumerator name='DMA_SLAVE_BUSWIDTH_32_BYTES' value='32'/>
        <enumerator name='DMA_SLAVE_BUSWIDTH_64_BYTES' value='64'/>
      </enum-decl>
      <enum-decl name='dma_status' filepath='include/linux/dmaengine.h' line='37' column='1' id='02ac9d9d'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='DMA_COMPLETE' value='0'/>
        <enumerator name='DMA_IN_PROGRESS' value='1'/>
        <enumerator name='DMA_PAUSED' value='2'/>
        <enumerator name='DMA_ERROR' value='3'/>
      </enum-decl>
      <class-decl name='dma_tx_state' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='699' column='1' id='66bc63b4'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='last' type-id='6478ea0a' visibility='default' filepath='include/linux/dmaengine.h' line='700' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='used' type-id='6478ea0a' visibility='default' filepath='include/linux/dmaengine.h' line='701' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='residue' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='702' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='in_flight_bytes' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='703' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='dma_chan_dev' size-in-bits='6272' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='345' column='1' id='2765d8de'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='chan' type-id='27f3f5d9' visibility='default' filepath='include/linux/dmaengine.h' line='346' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='device' type-id='66e487eb' visibility='default' filepath='include/linux/dmaengine.h' line='347' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6208'>
          <var-decl name='dev_id' type-id='95e97e5e' visibility='default' filepath='include/linux/dmaengine.h' line='348' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='dma_chan_percpu' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='278' column='1' id='ea186880'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='memcpy_count' type-id='7359adad' visibility='default' filepath='include/linux/dmaengine.h' line='280' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='bytes_transferred' type-id='7359adad' visibility='default' filepath='include/linux/dmaengine.h' line='281' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='dma_router' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='289' column='1' id='bfd10d03'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='dev' type-id='fa0b179b' visibility='default' filepath='include/linux/dmaengine.h' line='290' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='route_free' type-id='680bf43c' visibility='default' filepath='include/linux/dmaengine.h' line='291' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='dma_slave_caps' size-in-bits='224' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='477' column='1' id='08e15723'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='src_addr_widths' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='478' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='dst_addr_widths' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='479' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='directions' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='480' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='max_burst' type-id='19c2251e' visibility='default' filepath='include/linux/dmaengine.h' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='cmd_pause' type-id='b50a4934' visibility='default' filepath='include/linux/dmaengine.h' line='482' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='136'>
          <var-decl name='cmd_resume' type-id='b50a4934' visibility='default' filepath='include/linux/dmaengine.h' line='483' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='144'>
          <var-decl name='cmd_terminate' type-id='b50a4934' visibility='default' filepath='include/linux/dmaengine.h' line='484' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='residue_granularity' type-id='cad02db3' visibility='default' filepath='include/linux/dmaengine.h' line='485' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='descriptor_reuse' type-id='b50a4934' visibility='default' filepath='include/linux/dmaengine.h' line='486' column='1'/>
        </data-member>
      </class-decl>
      <qualified-type-def type-id='848612dc' const='yes' id='de25fc7b'/>
      <pointer-type-def type-id='de25fc7b' size-in-bits='64' id='06cc3383'/>
      <qualified-type-def type-id='931aa361' const='yes' id='921fbfdc'/>
      <pointer-type-def type-id='921fbfdc' size-in-bits='64' id='fdfb3042'/>
      <pointer-type-def type-id='b50ce591' size-in-bits='64' id='0e3f80d9'/>
      <pointer-type-def type-id='81e2e960' size-in-bits='64' id='35da6582'/>
      <pointer-type-def type-id='bbe0df86' size-in-bits='64' id='2fa81f80'/>
      <pointer-type-def type-id='22b04425' size-in-bits='64' id='187c2c79'/>
      <pointer-type-def type-id='d42dfd68' size-in-bits='64' id='3e2efc02'/>
      <pointer-type-def type-id='c9c16460' size-in-bits='64' id='3cbeb812'/>
      <pointer-type-def type-id='494c865e' size-in-bits='64' id='81ec80b0'/>
      <pointer-type-def type-id='08dd4249' size-in-bits='64' id='d37a2705'/>
      <pointer-type-def type-id='e070d395' size-in-bits='64' id='9c36e869'/>
      <pointer-type-def type-id='1d86628a' size-in-bits='64' id='16a27d24'/>
      <pointer-type-def type-id='68595236' size-in-bits='64' id='f166bad0'/>
      <pointer-type-def type-id='13de152d' size-in-bits='64' id='7be3d1f9'/>
      <pointer-type-def type-id='e4bb0da5' size-in-bits='64' id='37513679'/>
      <pointer-type-def type-id='5e3b10ab' size-in-bits='64' id='27f3f5d9'/>
      <pointer-type-def type-id='2765d8de' size-in-bits='64' id='114d14e4'/>
      <pointer-type-def type-id='ea186880' size-in-bits='64' id='f8c8e796'/>
      <pointer-type-def type-id='dbae75d6' size-in-bits='64' id='924ae97c'/>
      <pointer-type-def type-id='0dcaa1e4' size-in-bits='64' id='c60ba652'/>
      <pointer-type-def type-id='543d1e64' size-in-bits='64' id='a987c462'/>
      <pointer-type-def type-id='bfd10d03' size-in-bits='64' id='70a92833'/>
      <pointer-type-def type-id='08e15723' size-in-bits='64' id='d9f19b23'/>
      <pointer-type-def type-id='d356829c' size-in-bits='64' id='4f22192a'/>
      <pointer-type-def type-id='66bc63b4' size-in-bits='64' id='98d7a132'/>
      <pointer-type-def type-id='b32b9ce4' size-in-bits='64' id='e220a5e2'/>
      <pointer-type-def type-id='261b7c73' size-in-bits='64' id='e4038107'/>
      <pointer-type-def type-id='6dd06c9d' size-in-bits='64' id='dccdb2b1'/>
      <pointer-type-def type-id='734a42c0' size-in-bits='64' id='8f20abb2'/>
      <pointer-type-def type-id='13be8ab4' size-in-bits='64' id='7a89a746'/>
      <pointer-type-def type-id='04c69dd4' size-in-bits='64' id='8425c356'/>
      <pointer-type-def type-id='dfde97ed' size-in-bits='64' id='81aefe59'/>
      <pointer-type-def type-id='a46c8018' size-in-bits='64' id='b0e7dbd3'/>
      <pointer-type-def type-id='ccee3154' size-in-bits='64' id='aa8ac136'/>
      <pointer-type-def type-id='d9866c79' size-in-bits='64' id='fb8c75c5'/>
      <pointer-type-def type-id='b5d4a6d2' size-in-bits='64' id='680bf43c'/>
      <pointer-type-def type-id='a198c269' size-in-bits='64' id='42e84365'/>
      <pointer-type-def type-id='7dccafaf' size-in-bits='64' id='75adfaf3'/>
      <pointer-type-def type-id='67173869' size-in-bits='64' id='4127e705'/>
      <pointer-type-def type-id='1c2e282d' size-in-bits='64' id='31316b61'/>
      <pointer-type-def type-id='1785a6e2' size-in-bits='64' id='b698e72c'/>
      <function-decl name='dma_release_channel' mangled-name='dma_release_channel' filepath='drivers/dma/dmaengine.c' line='907' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dma_release_channel'>
        <parameter type-id='27f3f5d9' name='chan' filepath='drivers/dma/dmaengine.c' line='907' column='1'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='dma_get_slave_caps' mangled-name='dma_get_slave_caps' filepath='drivers/dma/dmaengine.c' line='570' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dma_get_slave_caps'>
        <parameter type-id='27f3f5d9' name='chan' filepath='drivers/dma/dmaengine.c' line='570' column='1'/>
        <parameter type-id='d9f19b23' name='caps' filepath='drivers/dma/dmaengine.c' line='570' column='1'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='dma_request_chan' mangled-name='dma_request_chan' filepath='drivers/dma/dmaengine.c' line='801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dma_request_chan'>
        <parameter type-id='fa0b179b' name='dev' filepath='drivers/dma/dmaengine.c' line='801' column='1'/>
        <parameter type-id='80f4b756' name='name' filepath='drivers/dma/dmaengine.c' line='801' column='1'/>
        <return type-id='27f3f5d9'/>
      </function-decl>
      <function-type size-in-bits='64' id='81e2e960'>
        <parameter type-id='27f3f5d9'/>
        <parameter type-id='e835b5d8'/>
        <parameter type-id='e835b5d8'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='b0e7dbd3'/>
        <parameter type-id='7359adad'/>
        <return type-id='0e3f80d9'/>
      </function-type>
      <function-type size-in-bits='64' id='bbe0df86'>
        <parameter type-id='27f3f5d9'/>
        <parameter type-id='e835b5d8'/>
        <parameter type-id='e835b5d8'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='354f7eb9'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='7359adad'/>
        <return type-id='0e3f80d9'/>
      </function-type>
      <function-type size-in-bits='64' id='22b04425'>
        <parameter type-id='27f3f5d9'/>
        <parameter type-id='e835b5d8'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='b0e7dbd3'/>
        <parameter type-id='7359adad'/>
        <return type-id='0e3f80d9'/>
      </function-type>
      <function-type size-in-bits='64' id='d42dfd68'>
        <parameter type-id='27f3f5d9'/>
        <parameter type-id='a987c462'/>
        <parameter type-id='7359adad'/>
        <return type-id='0e3f80d9'/>
      </function-type>
      <function-type size-in-bits='64' id='c9c16460'>
        <parameter type-id='27f3f5d9'/>
        <parameter type-id='bf3ef905'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='941ca9e2'/>
        <parameter type-id='7359adad'/>
        <parameter type-id='eaa32e2f'/>
        <return type-id='0e3f80d9'/>
      </function-type>
      <function-type size-in-bits='64' id='494c865e'>
        <parameter type-id='27f3f5d9'/>
        <parameter type-id='bf3ef905'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <parameter type-id='7359adad'/>
        <return type-id='0e3f80d9'/>
      </function-type>
      <function-type size-in-bits='64' id='08dd4249'>
        <parameter type-id='27f3f5d9'/>
        <parameter type-id='cf29c9b3'/>
        <parameter type-id='e835b5d8'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='7359adad'/>
        <return type-id='0e3f80d9'/>
      </function-type>
      <function-type size-in-bits='64' id='e070d395'>
        <parameter type-id='27f3f5d9'/>
        <parameter type-id='cf29c9b3'/>
        <parameter type-id='95e97e5e'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='7359adad'/>
        <return type-id='0e3f80d9'/>
      </function-type>
      <function-type size-in-bits='64' id='1d86628a'>
        <parameter type-id='27f3f5d9'/>
        <parameter type-id='cf29c9b3'/>
        <parameter type-id='cf29c9b3'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='7359adad'/>
        <return type-id='0e3f80d9'/>
      </function-type>
      <function-type size-in-bits='64' id='68595236'>
        <parameter type-id='27f3f5d9'/>
        <parameter type-id='cf29c9b3'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='941ca9e2'/>
        <parameter type-id='7359adad'/>
        <return type-id='0e3f80d9'/>
      </function-type>
      <function-type size-in-bits='64' id='13de152d'>
        <parameter type-id='27f3f5d9'/>
        <parameter type-id='cf29c9b3'/>
        <parameter type-id='91ce1af9'/>
        <parameter type-id='7359adad'/>
        <return type-id='0e3f80d9'/>
      </function-type>
      <function-type size-in-bits='64' id='e4bb0da5'>
        <parameter type-id='27f3f5d9'/>
        <parameter type-id='7359adad'/>
        <return type-id='0e3f80d9'/>
      </function-type>
